2ARC/lwip-on-Kinetis-mcu/Sources/main.c
/* ###################################################################
**     Filename    : main.c
**     Project     : MK64FX512_ethernet
**     Processor   : MK64FX512VLL12
**     Version     : Driver 01.01
**     Compiler    : GNU C Compiler
**     Date/Time   : 2021-02-19, 23:41, # CodeGen: 0
**     Abstract    :
**         Main module.
**         This module contains user's application code.
**     Settings    :
**     Contents    :
**         No public methods
**
** ###################################################################*/
/*!
** @file main.c
** @version 01.01
** @brief
**         Main module.
**         This module contains user's application code.
*/         
/*!
**  @addtogroup main_module main module documentation
**  @{
*/         
/* MODULE main */


/* Including needed modules to compile this module/procedure */
#include "Cpu.h"
#include "Events.h"
#include "clockMan1.h"
#include "pin_mux.h"
#include "osa1.h"
#include "gpio1.h"
#include "pitTimer1.h"
#include "eNet1.h"
#include "FRTOS1.h"
#include "UTIL1.h"
#include "KSDK1.h"
#if CPU_INIT_CONFIG
  #include "Init_Config.h"
#endif
/* User includes (#include below this line is not maintained by Processor Expert) */
#define DHCP_TIMEOUT 10

#include "lwip/api.h"
#include "lwip/tcpip.h"
#include "lwip/udp.h"
#include "lwip/dhcp.h"
#include "netif/etharp.h"
#include "ethernetif.h"
#include <string.h>
#include <stdio.h>
///////////////////////////////////////////////
#include "lwip/opt.h"
#include "httpd.h"
#include "lwip/debug.h"
#include "lwip/stats.h"
#include "httpd_structs.h"
#include "lwip/tcp.h"
#include "fs.h"
#include "lwip/mem.h"
#include "lwip/raw.h"
#include "lwip/icmp.h"
#include "lwip/netif.h"
#include "lwip/sys.h"
#include "lwip/timers.h"
#include "lwip/inet_chksum.h"
#include "lwip/init.h"
#include "netif/etharp.h"
#include "fsl_clock_manager.h"
#include "fsl_device_registers.h"
#include "fsl_port_hal.h"
#include "fsl_sim_hal.h"
#include "fsl_os_abstraction.h"
#include "ethernetif.h"
#include "board.h"
////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////
// Variables
///////////////////////////////////////////////////////////////////////////////

uint32_t portBaseAddr[] = PORT_BASE_ADDRS;
uint32_t simBaseAddr[] = SIM_BASE_ADDRS;

///////////////////////////////////////////////////////////////////////////////
// Definitions
///////////////////////////////////////////////////////////////////////////////

#ifndef HTTPD_DEBUG
#define HTTPD_DEBUG         LWIP_DBG_OFF
#endif

// Set this to 1 and add the next line to lwippools.h to use a memp pool
// for allocating struct http_state instead of the heap:
// LWIP_MEMPOOL(HTTPD_STATE, 20, 100, "HTTPD_STATE")
#ifndef HTTPD_USE_MEM_POOL
#define HTTPD_USE_MEM_POOL  0
#endif

// The server port for HTTPD to use
#ifndef HTTPD_SERVER_PORT
#define HTTPD_SERVER_PORT                   80
#endif

// Maximum retries before the connection is aborted/closed.
// - number of times pcb->poll is called -> default is 4*500ms = 2s;
// - reset when pcb->sent is called
#ifndef HTTPD_MAX_RETRIES
#define HTTPD_MAX_RETRIES                   4
#endif

// The poll delay is X*500ms
#ifndef HTTPD_POLL_INTERVAL
#define HTTPD_POLL_INTERVAL                 4
#endif

// Priority for tcp pcbs created by HTTPD (very low by default).
// Lower priorities get killed first when running out of memroy.
#ifndef HTTPD_TCP_PRIO
#define HTTPD_TCP_PRIO                      TCP_PRIO_MIN
#endif

// Set this to 1 to enabled timing each file sent
#ifndef LWIP_HTTPD_TIMING
#define LWIP_HTTPD_TIMING                   0
#endif
#ifndef HTTPD_DEBUG_TIMING
#define HTTPD_DEBUG_TIMING                  LWIP_DBG_OFF
#endif

// Set this to 1 on platforms where strnstr is not available
#ifndef LWIP_HTTPD_STRNSTR_PRIVATE
#define LWIP_HTTPD_STRNSTR_PRIVATE          1
#endif

// Set this to one to show error pages when parsing a request fails instead
// of simply closing the connection.
#ifndef LWIP_HTTPD_SUPPORT_EXTSTATUS
#define LWIP_HTTPD_SUPPORT_EXTSTATUS        0
#endif

// Set this to 0 to drop support for HTTP/0.9 clients (to save some bytes)
#ifndef LWIP_HTTPD_SUPPORT_V09
#define LWIP_HTTPD_SUPPORT_V09              1
#endif

// Set this to 1 to enable HTTP/1.1 persistent connections.
// ATTENTION: If the generated file system includes HTTP headers, these must
// include the "Connection: keep-alive" header (pass argument "-11" to makefsdata).
#ifndef LWIP_HTTPD_SUPPORT_11_KEEPALIVE
#define LWIP_HTTPD_SUPPORT_11_KEEPALIVE     0
#endif

// Set this to 1 to support HTTP request coming in in multiple packets/pbufs
#ifndef LWIP_HTTPD_SUPPORT_REQUESTLIST
#define LWIP_HTTPD_SUPPORT_REQUESTLIST      1
#endif

#if LWIP_HTTPD_SUPPORT_REQUESTLIST
// Number of rx pbufs to enqueue to parse an incoming request (up to the first newline)
#ifndef LWIP_HTTPD_REQ_QUEUELEN
#define LWIP_HTTPD_REQ_QUEUELEN             5
#endif

// Number of (TCP payload-) bytes (in pbufs) to enqueue to parse and incoming
// request (up to the first double-newline)
#ifndef LWIP_HTTPD_REQ_BUFSIZE
#define LWIP_HTTPD_REQ_BUFSIZE              LWIP_HTTPD_MAX_REQ_LENGTH
#endif

// Defines the maximum length of a HTTP request line (up to the first CRLF,
// copied from pbuf into this a global buffer when pbuf- or packet-queues
// are received - otherwise the input pbuf is used directly)
#ifndef LWIP_HTTPD_MAX_REQ_LENGTH
#define LWIP_HTTPD_MAX_REQ_LENGTH           LWIP_MIN(1023, (LWIP_HTTPD_REQ_QUEUELEN * PBUF_POOL_BUFSIZE))
#endif
#endif // LWIP_HTTPD_SUPPORT_REQUESTLIST

// Maximum length of the filename to send as response to a POST request,
// filled in by the application when a POST is finished.
#ifndef LWIP_HTTPD_POST_MAX_RESPONSE_URI_LEN
#define LWIP_HTTPD_POST_MAX_RESPONSE_URI_LEN 63
#endif

// Set this to 0 to not send the SSI tag (default is on, so the tag will
// be sent in the HTML page
#ifndef LWIP_HTTPD_SSI_INCLUDE_TAG
#define LWIP_HTTPD_SSI_INCLUDE_TAG           1
#endif

// Set this to 1 to call tcp_abort when tcp_close fails with memory error.
// This can be used to prevent consuming all memory in situations where the
// HTTP server has low priority compared to other communication.
#ifndef LWIP_HTTPD_ABORT_ON_CLOSE_MEM_ERROR
#define LWIP_HTTPD_ABORT_ON_CLOSE_MEM_ERROR  0
#endif

