2ARC/lwip-on-Kinetis-mcu/Sources/main.c
// Set this to 1 to kill the oldest connection when running out of
// memory for 'struct http_state' or 'struct http_ssi_state'.
// ATTENTION: This puts all connections on a linked list, so may be kind of slow.
#ifndef LWIP_HTTPD_KILL_OLD_ON_CONNECTIONS_EXCEEDED
#define LWIP_HTTPD_KILL_OLD_ON_CONNECTIONS_EXCEEDED 0
#endif

// Minimum length for a valid HTTP/0.9 request: "GET /\r\n" -> 7 bytes
#define MIN_REQ_LEN   7

#define CRLF "\r\n"
#define HTTP11_CONNECTIONKEEPALIVE "Connection: keep-alive"

#if LWIP_HTTPD_SSI
#define LWIP_HTTPD_IS_SSI(hs) ((hs)->ssi)
#else // LWIP_HTTPD_SSI
#define LWIP_HTTPD_IS_SSI(hs) 0
#endif // LWIP_HTTPD_SSI

// These defines check whether tcp_write has to copy data or not

// This was TI's check whether to let TCP copy data or not
// #define HTTP_IS_DATA_VOLATILE(hs) ((hs->file < (char *)0x20000000) ? 0 : TCP_WRITE_FLAG_COPY)
#ifndef HTTP_IS_DATA_VOLATILE
#if LWIP_HTTPD_SSI
// Copy for SSI files, no copy for non-SSI files
#define HTTP_IS_DATA_VOLATILE(hs)   ((hs)->ssi ? TCP_WRITE_FLAG_COPY : 0)
#else // LWIP_HTTPD_SSI
// Default: don't copy if the data is sent from file-system directly
#define HTTP_IS_DATA_VOLATILE(hs) (((hs->file != NULL) && (hs->handle != NULL) && (hs->file == \
    (char*)hs->handle->data + hs->handle->len - hs->left)) \
    ? 0 : TCP_WRITE_FLAG_COPY)
#endif /* LWIP_HTTPD_SSI */
#endif

// Default: headers are sent from ROM
#ifndef HTTP_IS_HDR_VOLATILE
#define HTTP_IS_HDR_VOLATILE(hs, ptr) 0
#endif

#if LWIP_HTTPD_SSI
// Default: Tags are sent from struct http_state and are therefore volatile
#ifndef HTTP_IS_TAG_VOLATILE
#define HTTP_IS_TAG_VOLATILE(ptr) TCP_WRITE_FLAG_COPY
#endif
#endif // LWIP_HTTPD_SSI

// Return values for http_send_*()
#define HTTP_DATA_TO_SEND_BREAK    2
#define HTTP_DATA_TO_SEND_CONTINUE 1
#define HTTP_NO_DATA_TO_SEND       0

#if HTTPD_USE_MEM_POOL
#define HTTP_ALLOC_SSI_STATE()  (struct http_ssi_state *)memp_malloc(MEMP_HTTPD_SSI_STATE)
#define HTTP_ALLOC_HTTP_STATE() (struct http_state *)memp_malloc(MEMP_HTTPD_STATE)
#else // HTTPD_USE_MEM_POOL
#define HTTP_ALLOC_SSI_STATE()  (struct http_ssi_state *)mem_malloc(sizeof(struct http_ssi_state))
#define HTTP_ALLOC_HTTP_STATE() (struct http_state *)mem_malloc(sizeof(struct http_state))
#endif // HTTPD_USE_MEM_POOL

typedef struct
{
    const char *name;
    u8_t shtml;
} default_filename;

const default_filename g_psDefaultFilenames[] = {
    {"/index.shtml", 1 },
    {"/index.ssi",   1 },
    {"/index.shtm",  1 },
    {"/index.html",  0 },
    {"/index.htm",   0 }
};

#define NUM_DEFAULT_FILENAMES (sizeof(g_psDefaultFilenames) /   \
    sizeof(default_filename))

#if LWIP_HTTPD_SUPPORT_REQUESTLIST
// HTTP request is copied here from pbufs for simple parsing
static char httpd_req_buf[LWIP_HTTPD_MAX_REQ_LENGTH+1];
#endif // LWIP_HTTPD_SUPPORT_REQUESTLIST

#if LWIP_HTTPD_SUPPORT_POST
// Filename for response file to send when POST is finished
static char http_post_response_filename[LWIP_HTTPD_POST_MAX_RESPONSE_URI_LEN+1];
#endif // LWIP_HTTPD_SUPPORT_POST

#if LWIP_HTTPD_DYNAMIC_HEADERS
// The number of individual strings that comprise the headers sent before each requested file.
#define NUM_FILE_HDR_STRINGS 3
#endif // LWIP_HTTPD_DYNAMIC_HEADERS

#if LWIP_HTTPD_SSI

#define HTTPD_LAST_TAG_PART 0xFFFF

enum tag_check_state {
    TAG_NONE,       // Not processing an SSI tag
    TAG_LEADIN,     // Tag lead in "<!--#" being processed
    TAG_FOUND,      // Tag name being read, looking for lead-out start
    TAG_LEADOUT,    // Tag lead out "-->" being processed
    TAG_SENDING     // Sending tag replacement string
};

struct http_ssi_state {
    const char *parsed;     // Pointer to the first unparsed byte in buf.
#if !LWIP_HTTPD_SSI_INCLUDE_TAG
    const char *tag_started; // Pointer to the first opening '<' of the tag.
#endif // !LWIP_HTTPD_SSI_INCLUDE_TAG
    const char *tag_end;    // Pointer to char after the closing '>' of the tag.
    u32_t parse_left; // Number of unparsed bytes in buf.
    u16_t tag_index;   // Counter used by tag parsing state machine
    u16_t tag_insert_len; // Length of insert in string tag_insert
#if LWIP_HTTPD_SSI_MULTIPART
    u16_t tag_part; // Counter passed to and changed by tag insertion function to insert multiple times
#endif // LWIP_HTTPD_SSI_MULTIPART
    u8_t tag_name_len; // Length of the tag name in string tag_name
    char tag_name[LWIP_HTTPD_MAX_TAG_NAME_LEN + 1]; // Last tag name extracted
    char tag_insert[LWIP_HTTPD_MAX_TAG_INSERT_LEN + 1]; // Insert string for tag_name
    enum tag_check_state tag_state; // State of the tag processor
};
#endif // LWIP_HTTPD_SSI

struct http_state {
#if LWIP_HTTPD_KILL_OLD_ON_CONNECTIONS_EXCEEDED
    struct http_state *next;
#endif // LWIP_HTTPD_KILL_OLD_ON_CONNECTIONS_EXCEEDED
    struct fs_file file_handle;
    struct fs_file *handle;
    char *file;       // Pointer to first unsent byte in buf.

    struct tcp_pcb *pcb;
#if LWIP_HTTPD_SUPPORT_REQUESTLIST
    struct pbuf *req;
#endif // LWIP_HTTPD_SUPPORT_REQUESTLIST

#if LWIP_HTTPD_DYNAMIC_FILE_READ
    char *buf;        // File read buffer.
    int buf_len;      // Size of file read buffer, buf.
#endif // LWIP_HTTPD_DYNAMIC_FILE_READ
    u32_t left;       // Number of unsent bytes in buf.
    u8_t retries;
#if LWIP_HTTPD_SUPPORT_11_KEEPALIVE
    u8_t keepalive;
#endif // LWIP_HTTPD_SUPPORT_11_KEEPALIVE
#if LWIP_HTTPD_SSI
    struct http_ssi_state *ssi;
#endif // LWIP_HTTPD_SSI
#if LWIP_HTTPD_CGI
    char *params[LWIP_HTTPD_MAX_CGI_PARAMETERS]; // Params extracted from the request URI
    char *param_vals[LWIP_HTTPD_MAX_CGI_PARAMETERS]; // Values for each extracted param
#endif // LWIP_HTTPD_CGI
#if LWIP_HTTPD_DYNAMIC_HEADERS
    const char *hdrs[NUM_FILE_HDR_STRINGS]; // HTTP headers to be sent.
    u16_t hdr_pos;     // The position of the first unsent header byte in the current string
    u16_t hdr_index;   // The index of the hdr string currently being sent.
#endif // LWIP_HTTPD_DYNAMIC_HEADERS
#if LWIP_HTTPD_TIMING
    u32_t time_started;
#endif // LWIP_HTTPD_TIMING
#if LWIP_HTTPD_SUPPORT_POST
    u32_t post_content_len_left;
#if LWIP_HTTPD_POST_MANUAL_WND
    u32_t unrecved_bytes;
    u8_t no_auto_wnd;
    u8_t post_finished;
#endif // LWIP_HTTPD_POST_MANUAL_WND
#endif // LWIP_HTTPD_SUPPORT_POST
};

///////////////////////////////////////////////////////////////////////////////
// Prototypes
///////////////////////////////////////////////////////////////////////////////

static err_t http_close_conn(struct tcp_pcb *pcb, struct http_state *hs);
static err_t http_close_or_abort_conn(struct tcp_pcb *pcb, struct http_state *hs, u8_t abort_conn);
static err_t http_find_file(struct http_state *hs, const char *uri, int is_09);
static err_t http_init_file(struct http_state *hs, struct fs_file *file, int is_09, const char *uri, u8_t tag_check);
static err_t http_poll(void *arg, struct tcp_pcb *pcb);
#if LWIP_HTTPD_FS_ASYNC_READ
static void http_continue(void *connection);
#endif // LWIP_HTTPD_FS_ASYNC_READ

///////////////////////////////////////////////////////////////////////////////
// Variables
///////////////////////////////////////////////////////////////////////////////

#if LWIP_HTTPD_SSI
// SSI insert handler function pointer.
tSSIHandler g_pfnSSIHandler = NULL;
int g_iNumTags = 0;
const char **g_ppcTags = NULL;

#define LEN_TAG_LEAD_IN 5
const char * const g_pcTagLeadIn = "<!--#";

#define LEN_TAG_LEAD_OUT 3
const char * const g_pcTagLeadOut = "-->";
#endif // LWIP_HTTPD_SSI

#if LWIP_HTTPD_CGI
// CGI handler information
const tCGI *g_pCGIs;
int g_iNumCGIs;
#endif // LWIP_HTTPD_CGI

#if LWIP_HTTPD_KILL_OLD_ON_CONNECTIONS_EXCEEDED
// global list of active HTTP connections, use to kill the oldest when running out of memory
static struct http_state *http_connections;
#endif // LWIP_HTTPD_KILL_OLD_ON_CONNECTIONS_EXCEEDED

///////////////////////////////////////////////////////////////////////////////
// Code
///////////////////////////////////////////////////////////////////////////////

#if LWIP_HTTPD_STRNSTR_PRIVATE
/* Like strstr but does not need 'buffer' to be NULL-terminated */
static char* strnstr(const char* buffer, const char* token, size_t n)
{
    const char* p;
    int tokenlen = (int)strlen(token);
    if (tokenlen == 0)
    {
        return (char *)buffer;
    }
    for (p = buffer; *p && (p + tokenlen <= buffer + n); p++)
    {
        if ((*p == *token) && (strncmp(p, token, tokenlen) == 0))
        {
            return (char *)p;
        }
    }
    return NULL;
}
#endif // LWIP_HTTPD_STRNSTR_PRIVATE

#if LWIP_HTTPD_KILL_OLD_ON_CONNECTIONS_EXCEEDED
static void http_kill_oldest_connection(u8_t ssi_required)
{
    struct http_state *hs = http_connections;
    struct http_state *hs_free_next = NULL;
    while(hs && hs->next)
    {
        if (ssi_required)
        {
            if (hs->next->ssi != NULL)
            {
                hs_free_next = hs;
            }
        }
        else
        {
            hs_free_next = hs;
        }
        hs = hs->next;
    }
    if (hs_free_next != NULL)
    {
        LWIP_ASSERT("hs_free_next->next != NULL", hs_free_next->next != NULL);
        LWIP_ASSERT("hs_free_next->next->pcb != NULL", hs_free_next->next->pcb != NULL);
        // send RST when killing a connection because of memory shortage
        // this also unlinks the http_state from the list
        http_close_or_abort_conn(hs_free_next->next->pcb, hs_free_next->next, 1);
    }
}
#endif // LWIP_HTTPD_KILL_OLD_ON_CONNECTIONS_EXCEEDED

#if LWIP_HTTPD_SSI
/* Allocate as struct http_ssi_state. */
static struct http_ssi_state* http_ssi_state_alloc(void)
{
    struct http_ssi_state *ret = HTTP_ALLOC_SSI_STATE();
#if LWIP_HTTPD_KILL_OLD_ON_CONNECTIONS_EXCEEDED
    if (ret == NULL)
    {
        http_kill_oldest_connection(1);
        ret = HTTP_ALLOC_SSI_STATE();
    }
#endif // LWIP_HTTPD_KILL_OLD_ON_CONNECTIONS_EXCEEDED
    if (ret != NULL)
    {
        memset(ret, 0, sizeof(struct http_ssi_state));
    }
    return ret;
}

