2ARC/lwip-on-Kinetis-mcu/Sources/main.c
/* Free a struct http_ssi_state. */
static void http_ssi_state_free(struct http_ssi_state *ssi)
{
    if (ssi != NULL)
    {
#if HTTPD_USE_MEM_POOL
        memp_free(MEMP_HTTPD_SSI_STATE, ssi);
#else // HTTPD_USE_MEM_POOL
        mem_free(ssi);
#endif // HTTPD_USE_MEM_POOL
    }
}
#endif // LWIP_HTTPD_SSI

/* Initialize a struct http_state.*/
static void http_state_init(struct http_state* hs)
{
    // Initialize the structure.
    memset(hs, 0, sizeof(struct http_state));
#if LWIP_HTTPD_DYNAMIC_HEADERS
    // Indicate that the headers are not yet valid
    hs->hdr_index = NUM_FILE_HDR_STRINGS;
#endif // LWIP_HTTPD_DYNAMIC_HEADERS
}

/* Allocate a struct http_state. */
static struct http_state* http_state_alloc(void)
{
    struct http_state *ret = HTTP_ALLOC_HTTP_STATE();
#if LWIP_HTTPD_KILL_OLD_ON_CONNECTIONS_EXCEEDED
    if (ret == NULL)
    {
        http_kill_oldest_connection(0);
        ret = HTTP_ALLOC_HTTP_STATE();
    }
#endif // LWIP_HTTPD_KILL_OLD_ON_CONNECTIONS_EXCEEDED
    if (ret != NULL)
    {
        http_state_init(ret);
#if LWIP_HTTPD_KILL_OLD_ON_CONNECTIONS_EXCEEDED
        // add the connection to the list
        if (http_connections == NULL)
        {
            http_connections = ret;
        }
        else
        {
            struct http_state *last;
            for(last = http_connections; last->next != NULL; last = last->next);
            LWIP_ASSERT("last != NULL", last != NULL);
            last->next = ret;
        }
#endif // LWIP_HTTPD_KILL_OLD_ON_CONNECTIONS_EXCEEDED
    }
    return ret;
}

/* Free a struct http_state. Also frees the file data if dynamic. */
static void http_state_eof(struct http_state *hs)
{
    if(hs->handle)
    {
#if LWIP_HTTPD_TIMING
        u32_t ms_needed = sys_now() - hs->time_started;
        u32_t needed = LWIP_MAX(1, (ms_needed/100));
        LWIP_DEBUGF(HTTPD_DEBUG_TIMING, ("httpd: needed %"U32_F" ms to send file of %d bytes -> %"U32_F" bytes/sec\r\n",
        ms_needed, hs->handle->len, ((((u32_t)hs->handle->len) * 10) / needed)));
#endif // LWIP_HTTPD_TIMING
        fs_close(hs->handle);
        hs->handle = NULL;
    }
#if LWIP_HTTPD_DYNAMIC_FILE_READ
    if (hs->buf != NULL)
    {
        mem_free(hs->buf);
        hs->buf = NULL;
    }
#endif // LWIP_HTTPD_DYNAMIC_FILE_READ
#if LWIP_HTTPD_SSI
    if (hs->ssi)
    {
        http_ssi_state_free(hs->ssi);
        hs->ssi = NULL;
    }
#endif // LWIP_HTTPD_SSI
}

/* Free a struct http_state. Also frees the file data if dynamic. */
static void http_state_free(struct http_state *hs)
{
    if (hs != NULL)
    {
        http_state_eof(hs);
#if LWIP_HTTPD_KILL_OLD_ON_CONNECTIONS_EXCEEDED
        // take the connection off the list
        if (http_connections)
        {
            if (http_connections == hs)
            {
                http_connections = hs->next;
            }
            else
            {
                struct http_state *last;
                for(last = http_connections; last->next != NULL; last = last->next)
                {
                    if (last->next == hs)
                    {
                        last->next = hs->next;
                        break;
                    }
                }
            }
        }
#endif // LWIP_HTTPD_KILL_OLD_ON_CONNECTIONS_EXCEEDED
#if HTTPD_USE_MEM_POOL
        memp_free(MEMP_HTTPD_STATE, hs);
#else // HTTPD_USE_MEM_POOL
        mem_free(hs);
#endif // HTTPD_USE_MEM_POOL
    }
}

/*!
 * @brief Call tcp_write() in a loop trying smaller and smaller length
 *
 * @param pcb tcp_pcb to send
 * @param ptr Data to send
 * @param length Length of data to send (in/out: on return, contains the
 *        amount of data sent)
 * @param apiflags directly passed to tcp_write
 * @return the return value of tcp_write
 */
static err_t http_write(struct tcp_pcb *pcb, const void* ptr, u16_t *length, u8_t apiflags)
{
    u16_t len;
    err_t err;
    LWIP_ASSERT("length != NULL", length != NULL);
    len = *length;
    if (len == 0)
    {
        return ERR_OK;
    }
    do {
        LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE, ("Trying go send %d bytes\r\n", len));
        err = tcp_write(pcb, ptr, len, apiflags);
        if (err == ERR_MEM)
        {
            if ((tcp_sndbuf(pcb) == 0) ||
                    (tcp_sndqueuelen(pcb) >= TCP_SND_QUEUELEN))
            {
                // no need to try smaller sizes
                len = 1;
            }
            else
            {
                len /= 2;
            }
            LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE,
            ("Send failed, trying less (%d bytes)\r\n", len));
        }
    } while ((err == ERR_MEM) && (len > 1));

    if (err == ERR_OK)
    {
        LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE, ("Sent %d bytes\r\n", len));
    }
    else
    {
        LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE, ("Send failed with err %d (\"%s\")\r\n", err, lwip_strerr(err)));
    }

    *length = len;
    return err;
}

/*!
 * @brief The connection shall be actively closed (using RST to close from fault states).
 * Reset the sent- and recv-callbacks.
 *
 * @param pcb the tcp pcb to reset callbacks
 * @param hs connection state to free
 */
static err_t http_close_or_abort_conn(struct tcp_pcb *pcb, struct http_state *hs, u8_t abort_conn)
{
    err_t err;
    LWIP_DEBUGF(HTTPD_DEBUG, ("Closing connection %p\r\n", (void*)pcb));

#if LWIP_HTTPD_SUPPORT_POST
    if (hs != NULL)
    {
        if ((hs->post_content_len_left != 0)
#if LWIP_HTTPD_POST_MANUAL_WND
                || ((hs->no_auto_wnd != 0) && (hs->unrecved_bytes != 0))
#endif // LWIP_HTTPD_POST_MANUAL_WND
                )
        {
            // make sure the post code knows that the connection is closed
            http_post_response_filename[0] = 0;
            httpd_post_finished(hs, http_post_response_filename, LWIP_HTTPD_POST_MAX_RESPONSE_URI_LEN);
        }
    }
#endif // LWIP_HTTPD_SUPPORT_POST


    tcp_arg(pcb, NULL);
    tcp_recv(pcb, NULL);
    tcp_err(pcb, NULL);
    tcp_poll(pcb, NULL, 0);
    tcp_sent(pcb, NULL);
    if (hs != NULL)
    {
        http_state_free(hs);
    }

    if (abort_conn)
    {
        tcp_abort(pcb);
        return ERR_OK;
    }
    err = tcp_close(pcb);
    if (err != ERR_OK)
    {
        LWIP_DEBUGF(HTTPD_DEBUG, ("Error %d closing %p\r\n", err, (void*)pcb));
        // error closing, try again later in poll
        tcp_poll(pcb, http_poll, HTTPD_POLL_INTERVAL);
    }
    return err;
}

/*!
 * @brief The connection shall be actively closed.
 * Reset the sent- and recv-callbacks.
 *
 * @param pcb the tcp pcb to reset callbacks
 * @param hs connection state to free
 */
static err_t http_close_conn(struct tcp_pcb *pcb, struct http_state *hs)
{
    return http_close_or_abort_conn(pcb, hs, 0);
}

/* End of file: either close the connection (Connection: close)
 * or close the file (Connection: keep-alive)
 */
static void http_eof(struct tcp_pcb *pcb, struct http_state *hs)
{
    // HTTP/1.1 persistent connection? (Not supported for SSI)
#if LWIP_HTTPD_SUPPORT_11_KEEPALIVE
    if (hs->keepalive && !LWIP_HTTPD_IS_SSI(hs))
    {
        http_state_eof(hs);
        http_state_init(hs);
        hs->keepalive = 1;
    }
    else
#endif // LWIP_HTTPD_SUPPORT_11_KEEPALIVE
    {
        http_close_conn(pcb, hs);
    }
}

#if LWIP_HTTPD_CGI
/*!
 * @brief Extract URI parameters from the parameter-part of an URI in the form
 * "test.cgi?x=y" @todo: better explanation!
 * Pointers to the parameters are stored in hs->param_vals.
 *
 * @param hs http connection state
 * @param params pointer to the NULL-terminated parameter string from the URI
 * @return number of parameters extracted
 */
static int extract_uri_parameters(struct http_state *hs, char *params)
{
    char *pair;
    char *equals;
    int loop;

    // If we have no parameters at all, return immediately.
    if(!params || (params[0] == '\0'))
    {
        return(0);
    }

    // Get a pointer to our first parameter
    pair = params;

