2ARC/lwip-on-Kinetis-mcu/Sources/main.c
    // Parse up to LWIP_HTTPD_MAX_CGI_PARAMETERS from the passed string
    // and ignore the remainder (if any)
    for(loop = 0; (loop < LWIP_HTTPD_MAX_CGI_PARAMETERS) && pair; loop++)
    {
        // Save the name of the parameter
        hs->params[loop] = pair;

        // Remember the start of this name=value pair
        equals = pair;

        // Find the start of the next name=value pair and replace the delimiter
        // with a 0 to terminate the previous pair string.
        pair = strchr(pair, '&');
        if(pair)
        {
            *pair = '\0';
            pair++;
        }
        else
        {
            // We didn't find a new parameter so find the end of the URI
            // and replace the space with a '\0'
            pair = strchr(equals, ' ');
            if(pair)
            {
                *pair = '\0';
            }

            // Revert to NULL so that we exit the loop as expected.
            pair = NULL;
        }

        // Now find the '=' in the previous pair, replace it with '\0'
        // and save the parameter value string.
        equals = strchr(equals, '=');
        if(equals)
        {
            *equals = '\0';
            hs->param_vals[loop] = equals + 1;
        }
        else
        {
            hs->param_vals[loop] = NULL;
        }
    }

    return loop;
}
#endif // LWIP_HTTPD_CGI

#if LWIP_HTTPD_SSI
/*!
 * @brief Insert a tag (found in an shtml in the form of "<!--#tagname-->" into the file.
 * The tag's name is stored in ssi->tag_name (NULL-terminated), the replacement
 * should be written to hs->tag_insert (up to a length of LWIP_HTTPD_MAX_TAG_INSERT_LEN).
 * The amount of data written is stored to ssi->tag_insert_len.
 *
 * @todo: return tag_insert_len - maybe it can be removed from struct http_state?
 *
 * @param hs http connection state
 */
static void get_tag_insert(struct http_state *hs)
{
    int loop;
    size_t len;
    struct http_ssi_state *ssi;
    LWIP_ASSERT("hs != NULL", hs != NULL);
    ssi = hs->ssi;
    LWIP_ASSERT("ssi != NULL", ssi != NULL);
#if LWIP_HTTPD_SSI_MULTIPART
    u16_t current_tag_part = ssi->tag_part;
    ssi->tag_part = HTTPD_LAST_TAG_PART;
#endif // LWIP_HTTPD_SSI_MULTIPART

    if(g_pfnSSIHandler && g_ppcTags && g_iNumTags)
    {
        // Find this tag in the list we have been provided.
        for(loop = 0; loop < g_iNumTags; loop++)
        {
            if(strcmp(ssi->tag_name, g_ppcTags[loop]) == 0)
            {
                ssi->tag_insert_len = g_pfnSSIHandler(loop, ssi->tag_insert,
                LWIP_HTTPD_MAX_TAG_INSERT_LEN
#if LWIP_HTTPD_SSI_MULTIPART
                , current_tag_part, &ssi->tag_part
#endif // LWIP_HTTPD_SSI_MULTIPART
#if LWIP_HTTPD_FILE_STATE
                , hs->handle->state
#endif // LWIP_HTTPD_FILE_STATE
                );
                return;
            }
        }
    }

    // If we drop out, we were asked to serve a page which contains tags that
    // we don't have a handler for. Merely echo back the tags with an error marker.
#define UNKNOWN_TAG1_TEXT "<b>***UNKNOWN TAG "
#define UNKNOWN_TAG1_LEN  18
#define UNKNOWN_TAG2_TEXT "***</b>"
#define UNKNOWN_TAG2_LEN  7
    len = LWIP_MIN(strlen(ssi->tag_name),
    LWIP_HTTPD_MAX_TAG_INSERT_LEN - (UNKNOWN_TAG1_LEN + UNKNOWN_TAG2_LEN));
    MEMCPY(ssi->tag_insert, UNKNOWN_TAG1_TEXT, UNKNOWN_TAG1_LEN);
    MEMCPY(&ssi->tag_insert[UNKNOWN_TAG1_LEN], ssi->tag_name, len);
    MEMCPY(&ssi->tag_insert[UNKNOWN_TAG1_LEN + len], UNKNOWN_TAG2_TEXT, UNKNOWN_TAG2_LEN);
    ssi->tag_insert[UNKNOWN_TAG1_LEN + len + UNKNOWN_TAG2_LEN] = 0;

    len = strlen(ssi->tag_insert);
    LWIP_ASSERT("len <= 0xffff", len <= 0xffff);
    ssi->tag_insert_len = (u16_t)len;
}
#endif // LWIP_HTTPD_SSI

#if LWIP_HTTPD_DYNAMIC_HEADERS
/*
 * Generate the relevant HTTP headers for the given filename
 * and write them into the supplied buffer.
 */
static void get_http_headers(struct http_state *pState, char *pszURI)
{
    unsigned int iLoop;
    char *pszWork;
    char *pszExt;
    char *pszVars;

    // Ensure that we initialize the loop counter. */
    iLoop = 0;

    // In all cases, the second header we send is the server identification so set it here.
    pState->hdrs[1] = g_psHTTPHeaderStrings[HTTP_HDR_SERVER];

    // Is this a normal file or the special case we use to send back the
    // default "404: Page not found" response?
    if (pszURI == NULL)
    {
        pState->hdrs[0] = g_psHTTPHeaderStrings[HTTP_HDR_NOT_FOUND];
        pState->hdrs[2] = g_psHTTPHeaderStrings[DEFAULT_404_HTML];

        // Set up to send the first header string.
        pState->hdr_index = 0;
        pState->hdr_pos = 0;
        return;
    }
    else
    {
        //  We are dealing with a particular filename. Look for one other
        // special case.  We assume that any filename with "404" in it must be
        // indicative of a 404 server error whereas all other files require
        // the 200 OK header.
        if (strstr(pszURI, "404"))
        {
            pState->hdrs[0] = g_psHTTPHeaderStrings[HTTP_HDR_NOT_FOUND];
        }
        else if (strstr(pszURI, "400"))
        {
            pState->hdrs[0] = g_psHTTPHeaderStrings[HTTP_HDR_BAD_REQUEST];
        }
        else if (strstr(pszURI, "501"))
        {
            pState->hdrs[0] = g_psHTTPHeaderStrings[HTTP_HDR_NOT_IMPL];
        }
        else
        {
            pState->hdrs[0] = g_psHTTPHeaderStrings[HTTP_HDR_OK];
        }

        // Determine if the URI has any variables and, if so, temporarily remove them.
        pszVars = strchr(pszURI, '?');
        if(pszVars)
        {
            *pszVars = '\0';
        }

        // Get a pointer to the file extension.
        // We find this by looking for the last occurrence of "." in the filename passed.
        pszExt = NULL;
        pszWork = strchr(pszURI, '.');
        while(pszWork)
        {
            pszExt = pszWork + 1;
            pszWork = strchr(pszExt, '.');
        }

        // Now determine the content type and add the relevant header for that.
        for(iLoop = 0; (iLoop < NUM_HTTP_HEADERS) && pszExt; iLoop++)
        {
            // Have we found a matching extension?
            if(!strcmp(g_psHTTPHeaders[iLoop].extension, pszExt))
            {
                pState->hdrs[2] =
                g_psHTTPHeaderStrings[g_psHTTPHeaders[iLoop].headerIndex];
                break;
            }
        }

        // Reinstate the parameter marker if there was one in the original URI.
        if(pszVars)
        {
            *pszVars = '?';
        }
    }

    // Does the URL passed have any file extension?  If not, we assume it
    // is a special-case URL used for control state notification and we do
    // not send any HTTP headers with the response.
    if(!pszExt)
    {
        // Force the header index to a value indicating that all headers have already been sent.
        pState->hdr_index = NUM_FILE_HDR_STRINGS;
    }
    else
    {
        // Did we find a matching extension?
        if(iLoop == NUM_HTTP_HEADERS)
        {
            // No - use the default, plain text file type.
            pState->hdrs[2] = g_psHTTPHeaderStrings[HTTP_HDR_DEFAULT_TYPE];
        }

        // Set up to send the first header string.
        pState->hdr_index = 0;
        pState->hdr_pos = 0;
    }
}

/*!
 * @brief Sub-function of http_send(): send dynamic headers
 *
 * @returns: - HTTP_NO_DATA_TO_SEND: no new data has been enqueued
 *           - HTTP_DATA_TO_SEND_CONTINUE: continue with sending HTTP body
 *           - HTTP_DATA_TO_SEND_BREAK: data has been enqueued, headers pending,
 *                                      so don't send HTTP body yet
 */
static u8_t http_send_headers(struct tcp_pcb *pcb, struct http_state *hs)
{
    err_t err;
    u16_t len;
    u8_t data_to_send = HTTP_NO_DATA_TO_SEND;
    u16_t hdrlen, sendlen;

