2ARC/lwip-on-Kinetis-mcu/Sources/main.c
    // How much data can we send?
    len = tcp_sndbuf(pcb);
    sendlen = len;

    while(len && (hs->hdr_index < NUM_FILE_HDR_STRINGS) && sendlen)
    {
        const void *ptr;
        u16_t old_sendlen;
        // How much do we have to send from the current header?
        hdrlen = (u16_t)strlen(hs->hdrs[hs->hdr_index]);

        // How much of this can we send?
        sendlen = (len < (hdrlen - hs->hdr_pos)) ? len : (hdrlen - hs->hdr_pos);

        // Send this amount of data or as much as we can given memory constraints.
        ptr = (const void *)(hs->hdrs[hs->hdr_index] + hs->hdr_pos);
        old_sendlen = sendlen;
        err = http_write(pcb, ptr, &sendlen, HTTP_IS_HDR_VOLATILE(hs, ptr));
        if ((err == ERR_OK) && (old_sendlen != sendlen))
        {
            // Remember that we added some more data to be transmitted.
            data_to_send = HTTP_DATA_TO_SEND_CONTINUE;
        }
        else if (err != ERR_OK)
        {
            // special case: http_write does not try to send 1 byte
            sendlen = 0;
        }

        // Fix up the header position for the next time round.
        hs->hdr_pos += sendlen;
        len -= sendlen;

        // Have we finished sending this string?
        if(hs->hdr_pos == hdrlen)
        {
            // Yes - move on to the next one
            hs->hdr_index++;
            hs->hdr_pos = 0;
        }
    }
    // If we get here and there are still header bytes to send, we send
    // the header information we just wrote immediately. If there are no
    // more headers to send, but we do have file data to send, drop through
    // to try to send some file data too.
    if((hs->hdr_index < NUM_FILE_HDR_STRINGS) || !hs->file)
    {
        LWIP_DEBUGF(HTTPD_DEBUG, ("tcp_output\r\n"));
        return HTTP_DATA_TO_SEND_BREAK;
    }
    return data_to_send;
}
#endif // LWIP_HTTPD_DYNAMIC_HEADERS

/*!
 * @brief Sub-function of http_send(): end-of-file (or block) is reached,
 * either close the file or read the next block (if supported).
 *
 * @returns: 0 if the file is finished or no data has been read
 *           1 if the file is not finished and data has been read
 */
static u8_t http_check_eof(struct tcp_pcb *pcb, struct http_state *hs)
{
#if LWIP_HTTPD_DYNAMIC_FILE_READ
    int count;
#endif // LWIP_HTTPD_DYNAMIC_FILE_READ

    // Do we have a valid file handle?
    if (hs->handle == NULL)
    {
        // No - close the connection.
        http_eof(pcb, hs);
        return 0;
    }
    if (fs_bytes_left(hs->handle) <= 0)
    {
        // We reached the end of the file so this request is done.
        LWIP_DEBUGF(HTTPD_DEBUG, ("End of file.\r\n"));
        http_eof(pcb, hs);
        return 0;
    }
#if LWIP_HTTPD_DYNAMIC_FILE_READ
    // Do we already have a send buffer allocated?
    if(hs->buf)
    {
        // Yes - get the length of the buffer
        count = hs->buf_len;
    }
    else
    {
        // We don't have a send buffer so allocate one up to 2mss bytes long.
        count = 2 * tcp_mss(pcb);
        do {
            hs->buf = (char*)mem_malloc((mem_size_t)count);
            if (hs->buf != NULL)
            {
                hs->buf_len = count;
                break;
            }
            count = count / 2;
        } while (count > 100);

        // Did we get a send buffer? If not, return immediately.
        if (hs->buf == NULL)
        {
            LWIP_DEBUGF(HTTPD_DEBUG, ("No buff\r\n"));
            return 0;
        }
    }

    // Read a block of data from the file.
    LWIP_DEBUGF(HTTPD_DEBUG, ("Trying to read %d bytes.\r\n", count));

#if LWIP_HTTPD_FS_ASYNC_READ
    count = fs_read_async(hs->handle, hs->buf, count, http_continue, hs);
#else // LWIP_HTTPD_FS_ASYNC_READ
    count = fs_read(hs->handle, hs->buf, count);
#endif // LWIP_HTTPD_FS_ASYNC_READ
    if (count < 0
    {
        if (count == FS_READ_DELAYED)
        {
            // Delayed read, wait for FS to unblock us
            return 0;
        }
        // We reached the end of the file so this request is done.
        // @todo: don't close here for HTTP/1.1? */
        LWIP_DEBUGF(HTTPD_DEBUG, ("End of file.\r\n"));
        http_eof(pcb, hs);
        return 0;
    }

    // Set up to send the block of data we just read
    LWIP_DEBUGF(HTTPD_DEBUG, ("Read %d bytes.\r\n", count));
    hs->left = count;
    hs->file = hs->buf;
#if LWIP_HTTPD_SSI
    if (hs->ssi)
    {
        hs->ssi->parse_left = count;
        hs->ssi->parsed = hs->buf;
    }
#endif // LWIP_HTTPD_SSI
#else // LWIP_HTTPD_DYNAMIC_FILE_READ
    LWIP_ASSERT("SSI and DYNAMIC_HEADERS turned off but eof not reached", 0);
#endif // LWIP_HTTPD_SSI || LWIP_HTTPD_DYNAMIC_HEADERS
    return 1;
}

/*!
 * @brief Sub-function of http_send(): This is the normal send-routine for non-ssi files
 *
 * @returns: - 1: data has been written (so call tcp_ouput)
 *           - 0: no data has been written (no need to call tcp_output)
 */
static u8_t http_send_data_nonssi(struct tcp_pcb *pcb, struct http_state *hs)
{
    err_t err;
    u16_t len;
    u16_t mss;
    u8_t data_to_send = 0;

    // We are not processing an SHTML file so no tag checking is necessary.
    // Just send the data as we received it from the file.

    // We cannot send more data than space available in the send buffer.
    if (tcp_sndbuf(pcb) < hs->left)
    {
        len = tcp_sndbuf(pcb);
    }
    else
    {
        len = (u16_t)hs->left;
        LWIP_ASSERT("hs->left did not fit into u16_t!", (len == hs->left));
    }
    mss = tcp_mss(pcb);
    if (len > (2 * mss))
    {
        len = 2 * mss;
    }

    err = http_write(pcb, hs->file, &len, HTTP_IS_DATA_VOLATILE(hs));
    if (err == ERR_OK)
    {
        data_to_send = 1;
        hs->file += len;
        hs->left -= len;
    }

    return data_to_send;
}

#if LWIP_HTTPD_SSI
/*!
 * @brief Sub-function of http_send(): This is the send-routine for ssi files
 *
 * @returns: - 1: data has been written (so call tcp_ouput)
 *           - 0: no data has been written (no need to call tcp_output)
 */
static u8_t http_send_data_ssi(struct tcp_pcb *pcb, struct http_state *hs)
{
    err_t err = ERR_OK;
    u16_t len;
    u16_t mss;
    u8_t data_to_send = 0;

    struct http_ssi_state *ssi = hs->ssi;
    LWIP_ASSERT("ssi != NULL", ssi != NULL);
    // We are processing an SHTML file so need to scan for tags and replace
    // them with insert strings. We need to be careful here since a tag may
    // straddle the boundary of two blocks read from the file and we may also
    // have to split the insert string between two tcp_write operations.

    // How much data could we send?
    len = tcp_sndbuf(pcb);

    // Do we have remaining data to send before parsing more?
    if(ssi->parsed > hs->file) {
        // We cannot send more data than space available in the send buffer.
        if (tcp_sndbuf(pcb) < (ssi->parsed - hs->file))
        {
            len = tcp_sndbuf(pcb);
        }
        else
        {
            LWIP_ASSERT("Data size does not fit into u16_t!",
            (ssi->parsed - hs->file) <= 0xffff);
            len = (u16_t)(ssi->parsed - hs->file);
        }
        mss = tcp_mss(pcb);
        if(len > (2 * mss))
        {
            len = 2 * mss;
        }

        err = http_write(pcb, hs->file, &len, HTTP_IS_DATA_VOLATILE(hs));
        if (err == ERR_OK)
        {
            data_to_send = 1;
            hs->file += len;
            hs->left -= len;
        }

        // If the send buffer is full, return now.
        if(tcp_sndbuf(pcb) == 0)
        {
            return data_to_send;
        }
    }

    LWIP_DEBUGF(HTTPD_DEBUG, ("State %d, %d left\r\n", ssi->tag_state, (int)ssi->parse_left));

    // We have sent all the data that was already parsed so continue parsing
    // the buffer contents looking for SSI tags.
    while((ssi->parse_left) && (err == ERR_OK))
    {
        // @todo: somewhere in this loop, 'len' should grow again...
        if (len == 0)
        {
            return data_to_send;
        }
        switch(ssi->tag_state)
        {
            case TAG_NONE:
                // We are not currently processing an SSI tag so scan for the
                // start of the lead-in marker.
                if(*ssi->parsed == g_pcTagLeadIn[0])
                {
                    // We found what could be the lead-in for a new tag
                    // so change state appropriately.
                    ssi->tag_state = TAG_LEADIN;
                    ssi->tag_index = 1;
#if !LWIP_HTTPD_SSI_INCLUDE_TAG
                    ssi->tag_started = ssi->parsed;
#endif // !LWIP_HTTPD_SSI_INCLUDE_TAG
                }

                // Move on to the next character in the buffer
                ssi->parse_left--;
                ssi->parsed++;
                break;

            case TAG_LEADIN:
                // We are processing the lead-in marker, looking for the start of
                // the tag name.

                // Have we reached the end of the leadin?
                if(ssi->tag_index == LEN_TAG_LEAD_IN)
                {
                    ssi->tag_index = 0;
                    ssi->tag_state = TAG_FOUND;
                }
                else
                {
                    // Have we found the next character we expect for the tag leadin?
                    if(*ssi->parsed == g_pcTagLeadIn[ssi->tag_index])
                    {
                        // Yes - move to the next one unless we have found the complete
                        // leadin, in which case we start looking for the tag itself
                        ssi->tag_index++;
                    }
                    else
                    {
                        // We found an unexpected character so this is not a tag. Move
                        // back to idle state.
                        ssi->tag_state = TAG_NONE;
                    }

                    // Move on to the next character in the buffer
                    ssi->parse_left--;
                    ssi->parsed++;
                }
                break;

            case TAG_FOUND:
                // We are reading the tag name, looking for the start of the
                // lead-out marker and removing any whitespace found.

                // Remove leading whitespace between the tag leading and the first
                // tag name character.
                if((ssi->tag_index == 0) && ((*ssi->parsed == ' ') ||
                            (*ssi->parsed == '\t') || (*ssi->parsed == '\n') ||
                            (*ssi->parsed == '\r')))
                {
                    // Move on to the next character in the buffer
                    ssi->parse_left--;
                    ssi->parsed++;
                    break;
                }

