2ARC/lwip-on-Kinetis-mcu/Sources/main.c
                // Have we found the end of the tag name? This is signalled by
                // us finding the first leadout character or whitespace
                if((*ssi->parsed == g_pcTagLeadOut[0]) ||
                        (*ssi->parsed == ' ')  || (*ssi->parsed == '\t') ||
                        (*ssi->parsed == '\n') || (*ssi->parsed == '\r'))
                {
                    if(ssi->tag_index == 0)
                    {
                        // We read a zero length tag so ignore it.
                        ssi->tag_state = TAG_NONE;
                    }
                    else
                    {
                        // We read a non-empty tag so go ahead and look for the leadout string.
                        ssi->tag_state = TAG_LEADOUT;
                        LWIP_ASSERT("ssi->tag_index <= 0xff", ssi->tag_index <= 0xff);
                        ssi->tag_name_len = (u8_t)ssi->tag_index;
                        ssi->tag_name[ssi->tag_index] = '\0';
                        if(*ssi->parsed == g_pcTagLeadOut[0])
                        {
                            ssi->tag_index = 1;
                        }
                        else
                        {
                            ssi->tag_index = 0;
                        }
                    }
                }
                else
                {
                    // This character is part of the tag name so save it
                    if(ssi->tag_index < LWIP_HTTPD_MAX_TAG_NAME_LEN)
                    {
                        ssi->tag_name[ssi->tag_index++] = *ssi->parsed;
                    }
                    else
                    {
                        // The tag was too long so ignore it.
                        ssi->tag_state = TAG_NONE;
                    }
                }

                // Move on to the next character in the buffer
                ssi->parse_left--;
                ssi->parsed++;

                break;

                // We are looking for the end of the lead-out marker.
            case TAG_LEADOUT:
                // Remove leading whitespace between the tag leading and the first
                // tag leadout character.
                if((ssi->tag_index == 0) && ((*ssi->parsed == ' ') ||
                            (*ssi->parsed == '\t') || (*ssi->parsed == '\n') ||
                            (*ssi->parsed == '\r')))
                {
                    // Move on to the next character in the buffer
                    ssi->parse_left--;
                    ssi->parsed++;
                    break;
                }

                // Have we found the next character we expect for the tag leadout?
                if(*ssi->parsed == g_pcTagLeadOut[ssi->tag_index])
                {
                    // Yes - move to the next one unless we have found the complete
                    // leadout, in which case we need to call the client to process the tag.

                    // Move on to the next character in the buffer
                    ssi->parse_left--;
                    ssi->parsed++;

                    if(ssi->tag_index == (LEN_TAG_LEAD_OUT - 1))
                    {
                        // Call the client to ask for the insert string for the ag we just found.
#if LWIP_HTTPD_SSI_MULTIPART
                        ssi->tag_part = 0; // start with tag part 0
#endif // LWIP_HTTPD_SSI_MULTIPART
                        get_tag_insert(hs);

                        // Next time through, we are going to be sending data
                        // immediately, either the end of the block we start
                        // sending here or the insert string.
                        ssi->tag_index = 0;
                        ssi->tag_state = TAG_SENDING;
                        ssi->tag_end = ssi->parsed;
#if !LWIP_HTTPD_SSI_INCLUDE_TAG
                        ssi->parsed = ssi->tag_started;
#endif // !LWIP_HTTPD_SSI_INCLUDE_TAG

                        // If there is any unsent data in the buffer prior to the
                        // tag, we need to send it now.
                        if (ssi->tag_end > hs->file)
                        {
                            // How much of the data can we send?
#if LWIP_HTTPD_SSI_INCLUDE_TAG
                            if(len > ssi->tag_end - hs->file)
                            {
                                len = (u16_t)(ssi->tag_end - hs->file);
                            }
#else // LWIP_HTTPD_SSI_INCLUDE_TAG
                            if(len > ssi->tag_started - hs->file)
                            {
                                // we would include the tag in sending
                                len = (u16_t)(ssi->tag_started - hs->file);
                            }
#endif // LWIP_HTTPD_SSI_INCLUDE_TAG

                            err = http_write(pcb, hs->file, &len, HTTP_IS_DATA_VOLATILE(hs));
                            if (err == ERR_OK)
                            {
                                data_to_send = 1;
#if !LWIP_HTTPD_SSI_INCLUDE_TAG
                                if(ssi->tag_started <= hs->file)
                                {
                                    // pretend to have sent the tag, too
                                    len += ssi->tag_end - ssi->tag_started;
                                }
#endif // !LWIP_HTTPD_SSI_INCLUDE_TAG
                                hs->file += len;
                                hs->left -= len;
                            }
                        }
                    }
                    else
                    {
                        ssi->tag_index++;
                    }
                }
                else
                {
                    // We found an unexpected character so this is not a tag.
                    // Move back to idle state.
                    ssi->parse_left--;
                    ssi->parsed++;
                    ssi->tag_state = TAG_NONE;
                }
                break;

            // We have found a valid tag and are in the process of sending
            // data as a result of that discovery. We send either remaining data
            // from the file prior to the insert point or the insert string itself.
            case TAG_SENDING:
                // Do we have any remaining file data to send from the buffer prior to the tag?
                if(ssi->tag_end > hs->file)
                {
                    // How much of the data can we send?
#if LWIP_HTTPD_SSI_INCLUDE_TAG
                    if(len > ssi->tag_end - hs->file)
                    {
                        len = (u16_t)(ssi->tag_end - hs->file);
                    }
#else // LWIP_HTTPD_SSI_INCLUDE_TAG
                    LWIP_ASSERT("hs->started >= hs->file", ssi->tag_started >= hs->file);
                    if (len > ssi->tag_started - hs->file)
                    {
                        // we would include the tag in sending
                        len = (u16_t)(ssi->tag_started - hs->file);
                    }
#endif // LWIP_HTTPD_SSI_INCLUDE_TAG
                    if (len != 0)
                    {
                        err = http_write(pcb, hs->file, &len, HTTP_IS_DATA_VOLATILE(hs));
                    }
                    else
                    {
                        err = ERR_OK;
                    }
                    if (err == ERR_OK)
                    {
                        data_to_send = 1;
#if !LWIP_HTTPD_SSI_INCLUDE_TAG
                        if(ssi->tag_started <= hs->file)
                        {
                            // pretend to have sent the tag, too
                            len += ssi->tag_end - ssi->tag_started;
                        }
#endif // !LWIP_HTTPD_SSI_INCLUDE_TAG
                        hs->file += len;
                        hs->left -= len;
                    }
                }
                else
                {
#if LWIP_HTTPD_SSI_MULTIPART
                    if(ssi->tag_index >= ssi->tag_insert_len)
                    {
                        // Did the last SSIHandler have more to send?
                        if (ssi->tag_part != HTTPD_LAST_TAG_PART)
                        {
                            // If so, call it again
                            ssi->tag_index = 0;
                            get_tag_insert(hs);
                        }
                    }
#endif // LWIP_HTTPD_SSI_MULTIPART

                    // Do we still have insert data left to send?
                    if(ssi->tag_index < ssi->tag_insert_len)
                    {
                        // We are sending the insert string itself. How much of the
                        // insert can we send?
                        if(len > (ssi->tag_insert_len - ssi->tag_index))
                        {
                            len = (ssi->tag_insert_len - ssi->tag_index);
                        }

