2ARC/lwip-on-Kinetis-mcu/Sources/main.c
                        // Note that we set the copy flag here since we only have a
                        // single tag insert buffer per connection. If we don't do
                        // this, insert corruption can occur if more than one insert
                        // is processed before we call tcp_output.
                        err = http_write(pcb, &(ssi->tag_insert[ssi->tag_index]), &len,
                        HTTP_IS_TAG_VOLATILE(hs));
                        if (err == ERR_OK)
                        {
                            data_to_send = 1;
                            ssi->tag_index += len;
                            // Don't return here: keep on sending data
                        }
                    }
                    else
                    {
#if LWIP_HTTPD_SSI_MULTIPART
                        if (ssi->tag_part == HTTPD_LAST_TAG_PART)
#endif // LWIP_HTTPD_SSI_MULTIPART
                        {
                            // We have sent all the insert data so go back
                            // to looking for a new tag.
                            LWIP_DEBUGF(HTTPD_DEBUG, ("Everything sent.\r\n"));
                            ssi->tag_index = 0;
                            ssi->tag_state = TAG_NONE;
#if !LWIP_HTTPD_SSI_INCLUDE_TAG
                            ssi->parsed = ssi->tag_end;
#endif // !LWIP_HTTPD_SSI_INCLUDE_TAG
                        }
                    }
                    break;
                }
        }
    }

    // If we drop out of the end of the for loop, this implies we must have
    // file data to send so send it now. In TAG_SENDING state, we've already
    // handled this so skip the send if that's the case.
    if((ssi->tag_state != TAG_SENDING) && (ssi->parsed > hs->file))
    {
        // We cannot send more data than space available in the send buffer.
        if (tcp_sndbuf(pcb) < (ssi->parsed - hs->file))
        {
            len = tcp_sndbuf(pcb);
        }
        else
        {
            LWIP_ASSERT("Data size does not fit into u16_t!",
            (ssi->parsed - hs->file) <= 0xffff);
            len = (u16_t)(ssi->parsed - hs->file);
        }
        if(len > (2 * tcp_mss(pcb)))
        {
            len = 2 * tcp_mss(pcb);
        }

        err = http_write(pcb, hs->file, &len, HTTP_IS_DATA_VOLATILE(hs));
        if (err == ERR_OK)
        {
            data_to_send = 1;
            hs->file += len;
            hs->left -= len;
        }
    }
    return data_to_send;
}
#endif // LWIP_HTTPD_SSI

/*!
 * @brief Try to send more data on this pcb.
 *
 * @param pcb the pcb to send data
 * @param hs connection state
 */
static u8_t http_send(struct tcp_pcb *pcb, struct http_state *hs)
{
    u8_t data_to_send = HTTP_NO_DATA_TO_SEND;

    LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE, ("http_send: pcb=%p hs=%p left=%d\r\n", (void*)pcb,
    (void*)hs, hs != NULL ? (int)hs->left : 0));

#if LWIP_HTTPD_SUPPORT_POST && LWIP_HTTPD_POST_MANUAL_WND
    if (hs->unrecved_bytes != 0)
    {
        return 0;
    }
#endif // LWIP_HTTPD_SUPPORT_POST && LWIP_HTTPD_POST_MANUAL_WND

    // If we were passed a NULL state structure pointer, ignore the call.
    if (hs == NULL)
    {
        return 0;
    }

#if LWIP_HTTPD_FS_ASYNC_READ
    // Check if we are allowed to read from this file.
    // (e.g. SSI might want to delay sending until data is available)
    if (!fs_is_file_ready(hs->handle, http_continue, hs))
    {
        return 0;
    }
#endif // LWIP_HTTPD_FS_ASYNC_READ

#if LWIP_HTTPD_DYNAMIC_HEADERS
    // Do we have any more header data to send for this file?
    if(hs->hdr_index < NUM_FILE_HDR_STRINGS)
    {
        data_to_send = http_send_headers(pcb, hs);
        if (data_to_send != HTTP_DATA_TO_SEND_CONTINUE)
        {
            return data_to_send;
        }
    }
#endif // LWIP_HTTPD_DYNAMIC_HEADERS

    // Have we run out of file data to send? If so, we need to read the next block from the file.
    if (hs->left == 0)
    {
        if (!http_check_eof(pcb, hs))
        {
            return 0;
        }
    }

#if LWIP_HTTPD_SSI
    if(hs->ssi)
    {
        data_to_send = http_send_data_ssi(pcb, hs);
    }
    else
#endif // LWIP_HTTPD_SSI
    {
        data_to_send = http_send_data_nonssi(pcb, hs);
    }

    if((hs->left == 0) && (fs_bytes_left(hs->handle) <= 0))
    {
        // We reached the end of the file so this request is done.
        // This adds the FIN flag right into the last data segment.
        LWIP_DEBUGF(HTTPD_DEBUG, ("End of file.\r\n"));
        http_eof(pcb, hs);
        return 0;
    }
    LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE, ("send_data end.\r\n"));
    return data_to_send;
}

#if LWIP_HTTPD_SUPPORT_EXTSTATUS
/*!
 * @brief Initialize a http connection with a file to send for an error message
 *
 * @param hs http connection state
 * @param error_nr HTTP error number
 * @return ERR_OK if file was found and hs has been initialized correctly
 *         another err_t otherwise
 */
static err_t http_find_error_file(struct http_state *hs, u16_t error_nr)
{
    const char *uri1, *uri2, *uri3;
    err_t err;

    if (error_nr == 501)
    {
        uri1 = "/501.html";
        uri2 = "/501.htm";
        uri3 = "/501.shtml";
    }
    else
    {
        // 400 (bad request is the default)
        uri1 = "/400.html";
        uri2 = "/400.htm";
        uri3 = "/400.shtml";
    }
    err = fs_open(&hs->file_handle, uri1);
    if (err != ERR_OK)
    {
        err = fs_open(&hs->file_handle, uri2);
        if (err != ERR_OK)
        {
            err = fs_open(&hs->file_handle, uri3);
            if (err != ERR_OK)
            {
                LWIP_DEBUGF(HTTPD_DEBUG, ("Error page for error %"U16_F" not found\r\n",
                error_nr));
                return ERR_ARG;
            }
        }
    }
    return http_init_file(hs, &hs->file_handle, 0, NULL, 0);
}
#else // LWIP_HTTPD_SUPPORT_EXTSTATUS
#define http_find_error_file(hs, error_nr) ERR_ARG
#endif // LWIP_HTTPD_SUPPORT_EXTSTATUS

/*!
 * @brief Get the file struct for a 404 error page.
 * Tries some file names and returns NULL if none found.
 *
 * @param uri pointer that receives the actual file name URI
 * @return file struct for the error page or NULL no matching file was found
 */
static struct fs_file * http_get_404_file(struct http_state *hs, const char **uri)
{
    err_t err;

    *uri = "/404.html";
    err = fs_open(&hs->file_handle, *uri);
    if (err != ERR_OK)
    {
        // 404.html doesn't exist. Try 404.htm instead.
        *uri = "/404.htm";
        err = fs_open(&hs->file_handle, *uri);
        if (err != ERR_OK)
        {
            // 404.htm doesn't exist either. Try 404.shtml instead.
            *uri = "/404.shtml";
            err = fs_open(&hs->file_handle, *uri);
            if (err != ERR_OK)
            {
                // 404.htm doesn't exist either. Indicate to the caller that it should
                // send back a default 404 page.
                *uri = NULL;
                return NULL;
            }
        }
    }

    return &hs->file_handle;
}

#if LWIP_HTTPD_SUPPORT_POST
static err_t http_handle_post_finished(struct http_state *hs)
{
#if LWIP_HTTPD_POST_MANUAL_WND
    // Prevent multiple calls to httpd_post_finished, since it might have already
    // been called before from httpd_post_data_recved().
    if (hs->post_finished)
    {
        return ERR_OK;
    }
    hs->post_finished = 1;
#endif // LWIP_HTTPD_POST_MANUAL_WND
    // application error or POST finished
    // NULL-terminate the buffer
    http_post_response_filename[0] = 0;
    httpd_post_finished(hs, http_post_response_filename, LWIP_HTTPD_POST_MAX_RESPONSE_URI_LEN);
    return http_find_file(hs, http_post_response_filename, 0);
}

/*!
 * @brief Pass received POST body data to the application and correctly handle
 * returning a response document or closing the connection.
 * ATTENTION: The application is responsible for the pbuf now, so don't free it!
 *
 * @param hs http connection state
 * @param p pbuf to pass to the application
 * @return ERR_OK if passed successfully, another err_t if the response file
 *         hasn't been found (after POST finished)
 */
static err_t http_post_rxpbuf(struct http_state *hs, struct pbuf *p)
{
    err_t err;

    // adjust remaining Content-Length
    if (hs->post_content_len_left < p->tot_len)
    {
        hs->post_content_len_left = 0;
    }
    else
    {
        hs->post_content_len_left -= p->tot_len;
    }
    err = httpd_post_receive_data(hs, p);
    if ((err != ERR_OK) || (hs->post_content_len_left == 0))
    {
#if LWIP_HTTPD_SUPPORT_POST && LWIP_HTTPD_POST_MANUAL_WND
        if (hs->unrecved_bytes != 0)
        {
            return ERR_OK;
        }
#endif // LWIP_HTTPD_SUPPORT_POST && LWIP_HTTPD_POST_MANUAL_WND
        // application error or POST finished
        return http_handle_post_finished(hs);
    }

    return ERR_OK;
}

/*!
 * @brief Handle a post request. Called from http_parse_request when method 'POST'
 * is found.
 *
 * @param p The input pbuf (containing the POST header and body).
 * @param hs The http connection state.
 * @param data HTTP request (header and part of body) from input pbuf(s).
 * @param data_len Size of 'data'.
 * @param uri The HTTP URI parsed from input pbuf(s).
 * @param uri_end Pointer to the end of 'uri' (here, the rest of the HTTP
 *                header starts).
 * @return ERR_OK: POST correctly parsed and accepted by the application.
 *         ERR_INPROGRESS: POST not completely parsed (no error yet)
 *         another err_t: Error parsing POST or denied by the application
 */
static err_t http_post_request(struct pbuf **inp, struct http_state *hs,
char *data, u16_t data_len, char *uri, char *uri_end)
{
    err_t err;
    // search for end-of-header (first double-CRLF)
    char* crlfcrlf = strnstr(uri_end + 1, CRLF CRLF, data_len - (uri_end + 1 - data));

