2ARC/lwip-on-Kinetis-mcu/Sources/main.c
    if (crlfcrlf != NULL) {
        // search for "Content-Length: "
#define HTTP_HDR_CONTENT_LEN                "Content-Length: "
#define HTTP_HDR_CONTENT_LEN_LEN            16
#define HTTP_HDR_CONTENT_LEN_DIGIT_MAX_LEN  10
        char *scontent_len = strnstr(uri_end + 1, HTTP_HDR_CONTENT_LEN, crlfcrlf - (uri_end + 1));
        if (scontent_len != NULL)
        {
            char *scontent_len_end = strnstr(scontent_len + HTTP_HDR_CONTENT_LEN_LEN, CRLF, HTTP_HDR_CONTENT_LEN_DIGIT_MAX_LEN);
            if (scontent_len_end != NULL)
            {
                int content_len;
                char *conten_len_num = scontent_len + HTTP_HDR_CONTENT_LEN_LEN;
                *scontent_len_end = 0;
                content_len = atoi(conten_len_num);
                if (content_len > 0)
                {
                    // adjust length of HTTP header passed to application
                    const char *hdr_start_after_uri = uri_end + 1;
                    u16_t hdr_len = LWIP_MIN(data_len, crlfcrlf + 4 - data);
                    u16_t hdr_data_len = LWIP_MIN(data_len, crlfcrlf + 4 - hdr_start_after_uri);
                    u8_t post_auto_wnd = 1;
                    http_post_response_filename[0] = 0;
                    err = httpd_post_begin(hs, uri, hdr_start_after_uri, hdr_data_len, content_len,
                    http_post_response_filename, LWIP_HTTPD_POST_MAX_RESPONSE_URI_LEN, &post_auto_wnd);
                    if (err == ERR_OK)
                    {
                        // try to pass in data of the first pbuf(s)
                        struct pbuf *q = *inp;
                        u16_t start_offset = hdr_len;
#if LWIP_HTTPD_POST_MANUAL_WND
                        hs->no_auto_wnd = !post_auto_wnd;
#endif // LWIP_HTTPD_POST_MANUAL_WND
                        // set the Content-Length to be received for this POST
                        hs->post_content_len_left = (u32_t)content_len;

                        // get to the pbuf where the body starts
                        while((q != NULL) && (q->len <= start_offset))
                        {
                            struct pbuf *head = q;
                            start_offset -= q->len;
                            q = q->next;
                            // free the head pbuf
                            head->next = NULL;
                            pbuf_free(head);
                        }
                        *inp = NULL;
                        if (q != NULL)
                        {
                            // hide the remaining HTTP header
                            pbuf_header(q, -(s16_t)start_offset);
#if LWIP_HTTPD_POST_MANUAL_WND
                            if (!post_auto_wnd)
                            {
                                // already tcp_recved() this data...
                                hs->unrecved_bytes = q->tot_len;
                            }
#endif // LWIP_HTTPD_POST_MANUAL_WND
                            return http_post_rxpbuf(hs, q);
                        }
                        else
                        {
                            return ERR_OK;
                        }
                    }
                    else
                    {
                        // return file passed from application
                        return http_find_file(hs, http_post_response_filename, 0);
                    }
                }
                else
                {
                    LWIP_DEBUGF(HTTPD_DEBUG, ("POST received invalid Content-Length: %s\r\n",
                    conten_len_num));
                    return ERR_ARG;
                }
            }
        }
    }
    // if we come here, the POST is incomplete
#if LWIP_HTTPD_SUPPORT_REQUESTLIST
    return ERR_INPROGRESS;
#else // LWIP_HTTPD_SUPPORT_REQUESTLIST
    return ERR_ARG;
#endif // LWIP_HTTPD_SUPPORT_REQUESTLIST
}

#if LWIP_HTTPD_POST_MANUAL_WND
/*!
 * @brief A POST implementation can call this function to update the TCP window.
 * This can be used to throttle data reception (e.g. when received data is
 * programmed to flash and data is received faster than programmed).
 *
 * @param connection A connection handle passed to httpd_post_begin for which
 *        httpd_post_finished has *NOT* been called yet!
 * @param recved_len Length of data received (for window update)
 */
void httpd_post_data_recved(void *connection, u16_t recved_len)
{
    struct http_state *hs = (struct http_state*)connection;
    if (hs != NULL)
    {
        if (hs->no_auto_wnd)
        {
            u16_t len = recved_len;
            if (hs->unrecved_bytes >= recved_len)
            {
                hs->unrecved_bytes -= recved_len;
            }
            else
            {
                LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_LEVEL_WARNING, ("httpd_post_data_recved: recved_len too big\r\n"));
                len = (u16_t)hs->unrecved_bytes;
                hs->unrecved_bytes = 0;
            }
            if (hs->pcb != NULL)
            {
                if (len != 0)
                {
                    tcp_recved(hs->pcb, len);
                }
                if ((hs->post_content_len_left == 0) && (hs->unrecved_bytes == 0))
                {
                    // finished handling POST
                    http_handle_post_finished(hs);
                    http_send(hs->pcb, hs);
                }
            }
        }
    }
}
#endif // LWIP_HTTPD_POST_MANUAL_WND

#endif // LWIP_HTTPD_SUPPORT_POST

#if LWIP_HTTPD_FS_ASYNC_READ
/* Try to send more data if file has been blocked before
 * This is a callback function passed to fs_read_async().
 */
static void http_continue(void *connection)
{
    struct http_state *hs = (struct http_state*)connection;
    if (hs && (hs->pcb) && (hs->handle))
    {
        LWIP_ASSERT("hs->pcb != NULL", hs->pcb != NULL);
        LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE, ("httpd_continue: try to send more data\r\n"));
        if (http_send(hs->pcb, hs))
        {
            // If we wrote anything to be sent, go ahead and send it now.
            LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE, ("tcp_output\r\n"));
            tcp_output(hs->pcb);
        }
    }
}
#endif // LWIP_HTTPD_FS_ASYNC_READ

/*!
 * When data has been received in the correct state, try to parse it
 * as a HTTP request.
 *
 * @param p the received pbuf
 * @param hs the connection state
 * @param pcb the tcp_pcb which received this packet
 * @return ERR_OK if request was OK and hs has been initialized correctly
 *         ERR_INPROGRESS if request was OK so far but not fully received
 *         another err_t otherwise
 */
static err_t http_parse_request(struct pbuf **inp, struct http_state *hs, struct tcp_pcb *pcb)
{
    char *data;
    char *crlf;
    u16_t data_len;
    struct pbuf *p = *inp;
#if LWIP_HTTPD_SUPPORT_REQUESTLIST
    u16_t clen;
#endif // LWIP_HTTPD_SUPPORT_REQUESTLIST
#if LWIP_HTTPD_SUPPORT_POST
    err_t err;
#endif // LWIP_HTTPD_SUPPORT_POST

