2ARC/lwip-on-Kinetis-mcu/Sources/main.c
    LWIP_UNUSED_ARG(pcb); // only used for post
    LWIP_ASSERT("p != NULL", p != NULL);
    LWIP_ASSERT("hs != NULL", hs != NULL);

    if ((hs->handle != NULL) || (hs->file != NULL))
    {
        LWIP_DEBUGF(HTTPD_DEBUG, ("Received data while sending a file\r\n"));
        // already sending a file
        // @todo: abort?
        return ERR_USE;
    }

#if LWIP_HTTPD_SUPPORT_REQUESTLIST

    LWIP_DEBUGF(HTTPD_DEBUG, ("Received %"U16_F" bytes\r\n", p->tot_len));

    // first check allowed characters in this pbuf?

    // enqueue the pbuf
    if (hs->req == NULL)
    {
        LWIP_DEBUGF(HTTPD_DEBUG, ("First pbuf\r\n"));
        hs->req = p;
    }
    else
    {
        LWIP_DEBUGF(HTTPD_DEBUG, ("pbuf enqueued\r\n"));
        pbuf_cat(hs->req, p);
    }

    if (hs->req->next != NULL)
    {
        data_len = LWIP_MIN(hs->req->tot_len, LWIP_HTTPD_MAX_REQ_LENGTH);
        pbuf_copy_partial(hs->req, httpd_req_buf, data_len, 0);
        data = httpd_req_buf;
    }
    else
#endif // LWIP_HTTPD_SUPPORT_REQUESTLIST
    {
        data = (char *)p->payload;
        data_len = p->len;
        if (p->len != p->tot_len)
        {
            LWIP_DEBUGF(HTTPD_DEBUG, ("Warning: incomplete header due to chained pbufs\r\n"));
        }
    }

    // received enough data for minimal request?
    if (data_len >= MIN_REQ_LEN)
    {
        // wait for CRLF before parsing anything
        crlf = strnstr(data, CRLF, data_len);
        if (crlf != NULL)
        {
#if LWIP_HTTPD_SUPPORT_POST
            int is_post = 0;
#endif // LWIP_HTTPD_SUPPORT_POST
            int is_09 = 0;
            char *sp1, *sp2;
            u16_t left_len, uri_len;
            LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE, ("CRLF received, parsing request\r\n"));
            // parse method
            if (!strncmp(data, "GET ", 4))
            {
                sp1 = data + 3;
                // received GET request
                LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE, ("Received GET request\"\r\n"));
#if LWIP_HTTPD_SUPPORT_POST
            }
            else if (!strncmp(data, "POST ", 5))
            {
                // store request type
                is_post = 1;
                sp1 = data + 4;
                // received GET request
                LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE, ("Received POST request\r\n"));
#endif // LWIP_HTTPD_SUPPORT_POST
            }
            else
            {
                // null-terminate the METHOD (pbuf is freed anyway wen returning)
                data[4] = 0;
                // unsupported method!
                LWIP_DEBUGF(HTTPD_DEBUG, ("Unsupported request method (not implemented): \"%s\"\r\n",
                data));
                return http_find_error_file(hs, 501);
            }
            // if we come here, method is OK, parse URI
            left_len = data_len - ((sp1 +1) - data);
            sp2 = strnstr(sp1 + 1, " ", left_len);
#if LWIP_HTTPD_SUPPORT_V09
            if (sp2 == NULL)
            {
                // HTTP 0.9: respond with correct protocol version
                sp2 = strnstr(sp1 + 1, CRLF, left_len);
                is_09 = 1;
#if LWIP_HTTPD_SUPPORT_POST
                if (is_post)
                {
                    // HTTP/0.9 does not support POST
                    goto badrequest;
                }
#endif // LWIP_HTTPD_SUPPORT_POST
            }
#endif // LWIP_HTTPD_SUPPORT_V09
            uri_len = sp2 - (sp1 + 1);
            if ((sp2 != 0) && (sp2 > sp1))
            {
                // wait for CRLFCRLF (indicating end of HTTP headers) before parsing anything
                if (strnstr(data, CRLF CRLF, data_len) != NULL)
                {
                    char *uri = sp1 + 1;
#if LWIP_HTTPD_SUPPORT_11_KEEPALIVE
                    if (!is_09 && strnstr(data, HTTP11_CONNECTIONKEEPALIVE, data_len))
                    {
                        hs->keepalive = 1;
                    }
#endif // LWIP_HTTPD_SUPPORT_11_KEEPALIVE
                    // null-terminate the METHOD (pbuf is freed anyway wen returning)
                    *sp1 = 0;
                    uri[uri_len] = 0;
                    LWIP_DEBUGF(HTTPD_DEBUG, ("Received \"%s\" request for URI: \"%s\"\r\n",
                    data, uri));
#if LWIP_HTTPD_SUPPORT_POST
                    if (is_post)
                    {
#if LWIP_HTTPD_SUPPORT_REQUESTLIST
                        struct pbuf **q = &hs->req;
#else // LWIP_HTTPD_SUPPORT_REQUESTLIST
                        struct pbuf **q = inp;
#endif // LWIP_HTTPD_SUPPORT_REQUESTLIST
                        err = http_post_request(q, hs, data, data_len, uri, sp2);
                        if (err != ERR_OK)
                        {
                            /* restore header for next try */
                            *sp1 = ' ';
                            *sp2 = ' ';
                            uri[uri_len] = ' ';
                        }
                        if (err == ERR_ARG)
                        {
                            goto badrequest;
                        }
                        return err;
                    }
                    else
#endif // LWIP_HTTPD_SUPPORT_POST
                    {
                        return http_find_file(hs, uri, is_09);
                    }
                }
            }
            else
            {
                LWIP_DEBUGF(HTTPD_DEBUG, ("invalid URI\r\n"));
            }
        }
    }

#if LWIP_HTTPD_SUPPORT_REQUESTLIST
    clen = pbuf_clen(hs->req);
    if ((hs->req->tot_len <= LWIP_HTTPD_REQ_BUFSIZE) &&
            (clen <= LWIP_HTTPD_REQ_QUEUELEN))
    {
        // request not fully received (too short or CRLF is missing)
        return ERR_INPROGRESS;
    }
    else
#endif // LWIP_HTTPD_SUPPORT_REQUESTLIST
    {
#if LWIP_HTTPD_SUPPORT_POST
badrequest:
#endif // LWIP_HTTPD_SUPPORT_POST
        LWIP_DEBUGF(HTTPD_DEBUG, ("bad request\r\n"));
        // could not parse request
        return http_find_error_file(hs, 400);
    }
}

/*!
 * @brief Try to find the file specified by uri and, if found, initialize hs
 * accordingly.
 *
 * @param hs the connection state
 * @param uri the HTTP header URI
 * @param is_09 1 if the request is HTTP/0.9 (no HTTP headers in response)
 * @return ERR_OK if file was found and hs has been initialized correctly
 *         another err_t otherwise
 */
static err_t http_find_file(struct http_state *hs, const char *uri, int is_09)
{
    size_t loop;
    struct fs_file *file = NULL;
    char *params;
    err_t err;
#if LWIP_HTTPD_CGI
    int i;
    int count;
#endif // LWIP_HTTPD_CGI
#if !LWIP_HTTPD_SSI
    const
#endif // !LWIP_HTTPD_SSI
    // By default, assume we will not be processing server-side-includes tags
    u8_t tag_check = 0;

    // Have we been asked for the default root file?
    if((uri[0] == '/') &&  (uri[1] == 0))
    {
        // Try each of the configured default filenames until we find one that exists.
        for (loop = 0; loop < NUM_DEFAULT_FILENAMES; loop++)
        {
            LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE, ("Looking for %s...\r\n", g_psDefaultFilenames[loop].name));
            err = fs_open(&hs->file_handle, (char *)g_psDefaultFilenames[loop].name);
            uri = (char *)g_psDefaultFilenames[loop].name;
            if(err == ERR_OK)
            {
                file = &hs->file_handle;
                LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE, ("Opened.\r\n"));
#if LWIP_HTTPD_SSI
                tag_check = g_psDefaultFilenames[loop].shtml;
#endif /* LWIP_HTTPD_SSI */
                break;
            }
        }
        if (file == NULL)
        {
            // None of the default filenames exist so send back a 404 page
            file = http_get_404_file(hs, &uri);
#if LWIP_HTTPD_SSI
            tag_check = 0;
#endif // LWIP_HTTPD_SSI
        }
    }
    else
    {
        // No - we've been asked for a specific file.
        // First, isolate the base URI (without any parameters)
        params = (char *)strchr(uri, '?');
        if (params != NULL)
        {
            // URI contains parameters. NULL-terminate the base URI
            *params = '\0';
            params++;
        }

#if LWIP_HTTPD_CGI
        // Does the base URI we have isolated correspond to a CGI handler?
        if (g_iNumCGIs && g_pCGIs)
        {
            for (i = 0; i < g_iNumCGIs; i++)
            {
                if (strcmp(uri, g_pCGIs[i].pcCGIName) == 0)
                {
                    // We found a CGI that handles this URI so extract the
                    // parameters and call the handler.
                    count = extract_uri_parameters(hs, params);
                    uri = g_pCGIs[i].pfnCGIHandler(i, count, hs->params, hs->param_vals);
                    break;
                }
            }
        }
#endif // LWIP_HTTPD_CGI

        LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE, ("Opening %s\r\n", uri));

        err = fs_open(&hs->file_handle, uri);
        if (err == ERR_OK)
        {
            file = &hs->file_handle;
        }
        else
        {
            file = http_get_404_file(hs, &uri);
        }
#if LWIP_HTTPD_SSI
        if (file != NULL)
        {
            // See if we have been asked for an shtml file and, if so, enable tag checking.
            tag_check = 0;
            for (loop = 0; loop < NUM_SHTML_EXTENSIONS; loop++)
            {
                if (strstr(uri, g_pcSSIExtensions[loop]))
                {
                    tag_check = 1;
                    break;
                }
            }
        }
#endif // LWIP_HTTPD_SSI
    }
    return http_init_file(hs, file, is_09, uri, tag_check);
}

/*!
 * @brief Initialize a http connection with a file to send (if found).
 * Called by http_find_file and http_find_error_file.
 *
 * @param hs http connection state
 * @param file file structure to send (or NULL if not found)
 * @param is_09 1 if the request is HTTP/0.9 (no HTTP headers in response)
 * @param uri the HTTP header URI
 * @param tag_check enable SSI tag checking
 * @return ERR_OK if file was found and hs has been initialized correctly
 *         another err_t otherwise
 */
static err_t http_init_file(struct http_state *hs, struct fs_file *file, int is_09, const char *uri, u8_t tag_check)
{
    if (file != NULL)
    {
        // file opened, initialise struct http_state
#if LWIP_HTTPD_SSI
        if (tag_check)
        {
            struct http_ssi_state *ssi = http_ssi_state_alloc();
            if (ssi != NULL)
            {
                ssi->tag_index = 0;
                ssi->tag_state = TAG_NONE;
                ssi->parsed = file->data;
                ssi->parse_left = file->len;
                ssi->tag_end = file->data;
                hs->ssi = ssi;
            }
        }
#else // LWIP_HTTPD_SSI
        LWIP_UNUSED_ARG(tag_check);
#endif // LWIP_HTTPD_SSI
        hs->handle = file;
        hs->file = (char*)file->data;
        LWIP_ASSERT("File length must be positive!", (file->len >= 0));
        hs->left = file->len;
        hs->retries = 0;
#if LWIP_HTTPD_TIMING
        hs->time_started = sys_now();
#endif // LWIP_HTTPD_TIMING
#if !LWIP_HTTPD_DYNAMIC_HEADERS
        LWIP_ASSERT("HTTP headers not included in file system", hs->handle->http_header_included);
#endif // !LWIP_HTTPD_DYNAMIC_HEADERS
#if LWIP_HTTPD_SUPPORT_V09
        if (hs->handle->http_header_included && is_09)
        {
            // HTTP/0.9 responses are sent without HTTP header, search for the end of the header.
            char *file_start = strnstr(hs->file, CRLF CRLF, hs->left);
            if (file_start != NULL)
            {
                size_t diff = file_start + 4 - hs->file;
                hs->file += diff;
                hs->left -= (u32_t)diff;
            }
        }
#endif // LWIP_HTTPD_SUPPORT_V09
    }
    else
    {
        hs->handle = NULL;
        hs->file = NULL;
        hs->left = 0;
        hs->retries = 0;
    }
#if LWIP_HTTPD_DYNAMIC_HEADERS
    // Determine the HTTP headers to send based on the file extension of the requested URI.
    if ((hs->handle == NULL) || !hs->handle->http_header_included)
    {
        get_http_headers(hs, (char*)uri);
    }
#else // LWIP_HTTPD_DYNAMIC_HEADERS
    LWIP_UNUSED_ARG(uri);
#endif // LWIP_HTTPD_DYNAMIC_HEADERS
    return ERR_OK;
}

