2ARC/lwip-on-Kinetis-mcu/Sources/main.c
/*
 * The pcb had an error and is already deallocated.
 * The argument might still be valid (if != NULL).
 */
static void http_err(void *arg, err_t err)
{
    struct http_state *hs = (struct http_state *)arg;
    LWIP_UNUSED_ARG(err);

    LWIP_DEBUGF(HTTPD_DEBUG, ("http_err: %s", lwip_strerr(err)));

    if (hs != NULL)
    {
        http_state_free(hs);
    }
}

/*
 * Data has been sent and acknowledged by the remote host.
 * This means that more data can be sent.
 */
static err_t http_sent(void *arg, struct tcp_pcb *pcb, u16_t len)
{
    struct http_state *hs = (struct http_state *)arg;

    LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE, ("http_sent %p\r\n", (void*)pcb));

    LWIP_UNUSED_ARG(len);

    if (hs == NULL)
    {
        return ERR_OK;
    }

    hs->retries = 0;

    http_send(pcb, hs);

    return ERR_OK;
}

/*
 * The poll function is called every 2nd second.
 * If there has been no data sent (which resets the retries) in 8 seconds, close.
 * If the last portion of a file has not been sent in 2 seconds, close.
 *
 * This could be increased, but we don't want to waste resources for bad connections.
 */
static err_t http_poll(void *arg, struct tcp_pcb *pcb)
{
    struct http_state *hs = (struct http_state *)arg;
    LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE, ("http_poll: pcb=%p hs=%p pcb_state=%s\r\n",
    (void*)pcb, (void*)hs, tcp_debug_state_str(pcb->state)));

    if (hs == NULL)
    {
        err_t closed;
        // arg is null, close.
        LWIP_DEBUGF(HTTPD_DEBUG, ("http_poll: arg is NULL, close\r\n"));
        closed = http_close_conn(pcb, NULL);
        LWIP_UNUSED_ARG(closed);
#if LWIP_HTTPD_ABORT_ON_CLOSE_MEM_ERROR
        if (closed == ERR_MEM)
        {
            tcp_abort(pcb);
            return ERR_ABRT;
        }
#endif // LWIP_HTTPD_ABORT_ON_CLOSE_MEM_ERROR
        return ERR_OK;
    }
    else
    {
        hs->retries++;
        if (hs->retries == HTTPD_MAX_RETRIES)
        {
            LWIP_DEBUGF(HTTPD_DEBUG, ("http_poll: too many retries, close\r\n"));
            http_close_conn(pcb, hs);
            return ERR_OK;
        }

        // If this connection has a file open, try to send some more data. If
        // it has not yet received a GET request, don't do this since it will
        // cause the connection to close immediately.
        if(hs && (hs->handle))
        {
            LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE, ("http_poll: try to send more data\r\n"));
            if(http_send(pcb, hs))
            {
                // If we wrote anything to be sent, go ahead and send it now.
                LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE, ("tcp_output\r\n"));
                tcp_output(pcb);
            }
        }
    }

    return ERR_OK;
}

/*
 * Data has been received on this pcb.
 * For HTTP 1.0, this should normally only happen once (if the request fits in one packet).
 */
static err_t http_recv(void *arg, struct tcp_pcb *pcb, struct pbuf *p, err_t err)
{
    err_t parsed = ERR_ABRT;
    struct http_state *hs = (struct http_state *)arg;
    LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE, ("http_recv: pcb=%p pbuf=%p err=%s\r\n", (void*)pcb,
    (void*)p, lwip_strerr(err)));

    if ((err != ERR_OK) || (p == NULL) || (hs == NULL))
    {
        // error or closed by other side?
        if (p != NULL)
        {
            // Inform TCP that we have taken the data.
            tcp_recved(pcb, p->tot_len);
            pbuf_free(p);
        }
        if (hs == NULL)
        {
            // this should not happen, only to be robust
            LWIP_DEBUGF(HTTPD_DEBUG, ("Error, http_recv: hs is NULL, close\r\n"));
        }
        http_close_conn(pcb, hs);
        return ERR_OK;
    }

#if LWIP_HTTPD_SUPPORT_POST && LWIP_HTTPD_POST_MANUAL_WND
    if (hs->no_auto_wnd)
    {
        hs->unrecved_bytes += p->tot_len;
    }
    else
#endif // LWIP_HTTPD_SUPPORT_POST && LWIP_HTTPD_POST_MANUAL_WND
    {
        // Inform TCP that we have taken the data.
        tcp_recved(pcb, p->tot_len);
    }

#if LWIP_HTTPD_SUPPORT_POST
    if (hs->post_content_len_left > 0)
    {
        // reset idle counter when POST data is received
        hs->retries = 0;
        // this is data for a POST, pass the complete pbuf to the application
        http_post_rxpbuf(hs, p);
        // pbuf is passed to the application, don't free it!
        if (hs->post_content_len_left == 0)
        {
            // all data received, send response or close connection
            http_send(pcb, hs);
        }
        return ERR_OK;
    }
    else
#endif // LWIP_HTTPD_SUPPORT_POST
    {
        if (hs->handle == NULL)
        {
            parsed = http_parse_request(&p, hs, pcb);
            LWIP_ASSERT("http_parse_request: unexpected return value", parsed == ERR_OK
            || parsed == ERR_INPROGRESS ||parsed == ERR_ARG || parsed == ERR_USE);
        }
        else
        {
            LWIP_DEBUGF(HTTPD_DEBUG, ("http_recv: already sending data\r\n"));
        }
#if LWIP_HTTPD_SUPPORT_REQUESTLIST
        if (parsed != ERR_INPROGRESS)
        {
            // request fully parsed or error
            if (hs->req != NULL)
            {
                pbuf_free(hs->req);
                hs->req = NULL;
            }
        }
#else // LWIP_HTTPD_SUPPORT_REQUESTLIST
        if (p != NULL)
        {
            // pbuf not passed to application, free it now
            pbuf_free(p);
        }
#endif // LWIP_HTTPD_SUPPORT_REQUESTLIST
        if (parsed == ERR_OK)
        {
#if LWIP_HTTPD_SUPPORT_POST
            if (hs->post_content_len_left == 0)
#endif // LWIP_HTTPD_SUPPORT_POST
            {
                LWIP_DEBUGF(HTTPD_DEBUG | LWIP_DBG_TRACE, ("http_recv: data %p len %"S32_F"\r\n", hs->file, hs->left));
                http_send(pcb, hs);
            }
        }
        else if (parsed == ERR_ARG)
        {
            // @todo: close on ERR_USE?
            http_close_conn(pcb, hs);
        }
    }
    return ERR_OK;
}

/*
 * A new incoming connection has been accepted.
 */
static err_t http_accept(void *arg, struct tcp_pcb *pcb, err_t err)
{
    struct http_state *hs;
    struct tcp_pcb_listen *lpcb = (struct tcp_pcb_listen*)arg;
    LWIP_UNUSED_ARG(err);
    LWIP_DEBUGF(HTTPD_DEBUG, ("http_accept %p / %p\r\n", (void*)pcb, arg));

    // Decrease the listen backlog counter
    tcp_accepted(lpcb);
    // Set priority
    tcp_setprio(pcb, HTTPD_TCP_PRIO);

    // Allocate memory for the structure that holds the state of the
    // connection - initialized by that function.
    hs = http_state_alloc();
    if (hs == NULL)
    {
        LWIP_DEBUGF(HTTPD_DEBUG, ("http_accept: Out of memory, RST\r\n"));
        return ERR_MEM;
    }
    hs->pcb = pcb;

    // Tell TCP that this is the structure we wish to be passed for our callbacks.
    tcp_arg(pcb, hs);

    // Set up the various callback functions
    tcp_recv(pcb, http_recv);
    tcp_err(pcb, http_err);
    tcp_poll(pcb, http_poll, HTTPD_POLL_INTERVAL);
    tcp_sent(pcb, http_sent);

    return ERR_OK;
}

