2ARC/lwip-on-Kinetis-mcu/Sources/main.c
/*
 * Initialize the httpd with the specified local address.
 */
static void httpd_init_addr(ip_addr_t *local_addr)
{
    struct tcp_pcb *pcb;
    err_t err;

    pcb = tcp_new();
    LWIP_ASSERT("httpd_init: tcp_new failed", pcb != NULL);
    tcp_setprio(pcb, HTTPD_TCP_PRIO);
    // set SOF_REUSEADDR here to explicitly bind httpd to multiple interfaces
    err = tcp_bind(pcb, local_addr, HTTPD_SERVER_PORT);
    LWIP_ASSERT("httpd_init: tcp_bind failed", err == ERR_OK);
    pcb = tcp_listen(pcb);
    LWIP_ASSERT("httpd_init: tcp_listen failed", pcb != NULL);
    // initialize callback arg and accept callback
    tcp_arg(pcb, pcb);
    tcp_accept(pcb, http_accept);
}

/*
 * Initialize the httpd: set up a listening PCB and bind it to the defined port
 */
void httpd_init(void)
{
#if HTTPD_USE_MEM_POOL
    LWIP_ASSERT("memp_sizes[MEMP_HTTPD_STATE] >= sizeof(http_state)",
    memp_sizes[MEMP_HTTPD_STATE] >= sizeof(http_state));
    LWIP_ASSERT("memp_sizes[MEMP_HTTPD_SSI_STATE] >= sizeof(http_ssi_state)",
    memp_sizes[MEMP_HTTPD_SSI_STATE] >= sizeof(http_ssi_state));
#endif
    LWIP_DEBUGF(HTTPD_DEBUG, ("httpd_init\r\n"));

    httpd_init_addr(IP_ADDR_ANY);
}

#if LWIP_HTTPD_SSI
/*!
 * @brief Set the SSI handler function.
 *
 * @param ssi_handler the SSI handler function
 * @param tags an array of SSI tag strings to search for in SSI-enabled files
 * @param num_tags number of tags in the 'tags' array
 */
void http_set_ssi_handler(tSSIHandler ssi_handler, const char **tags, int num_tags)
{
    LWIP_DEBUGF(HTTPD_DEBUG, ("http_set_ssi_handler\r\n"));

    LWIP_ASSERT("no ssi_handler given", ssi_handler != NULL);
    LWIP_ASSERT("no tags given", tags != NULL);
    LWIP_ASSERT("invalid number of tags", num_tags > 0);

    g_pfnSSIHandler = ssi_handler;
    g_ppcTags = tags;
    g_iNumTags = num_tags;
}
#endif // LWIP_HTTPD_SSI

#if LWIP_HTTPD_CGI
/*!
 * @brief Set an array of CGI filenames/handler functions
 *
 * @param cgis an array of CGI filenames/handler functions
 * @param num_handlers number of elements in the 'cgis' array
 */
void http_set_cgi_handlers(const tCGI *cgis, int num_handlers)
{
    LWIP_ASSERT("no cgis given", cgis != NULL);
    LWIP_ASSERT("invalid number of handlers", num_handlers > 0);

    g_pCGIs = cgis;
    g_iNumCGIs = num_handlers;
}
#endif // LWIP_HTTPD_CGI

static void app_low_level_init(void)
{
    // Open uart module for debug
    hardware_init();

    // Open ENET clock gate
    CLOCK_SYS_EnableEnetClock(0);
    // Select PTP timer outclk
    CLOCK_SYS_SetEnetTimeStampSrc(0, kClockTimeSrcOsc0erClk);

    // Disable the mpu
    MPU_BWR_CESR_VLD(MPU, 0);
}
/**** CGI handler for controlling the LEDs ****/
// the function pointer for a CGI script handler is defined in httpd.h as tCGIHandler
const char * IoCGIhandler(int iIndex, int iNumParams, char *pcParam[], char *pcValue[])
{
uint32_t i = 0;
// index of the CGI within the theCGItable array passed to http_set_cgi_handlers
// Given how this example is structured, this may be a redundant check.
// Here there is only one handler iIndex == 0
if (iIndex == 0)
	{
		GPIO_DRV_WritePinOutput(RELE1, 0);
		GPIO_DRV_WritePinOutput(RELE2, 0);
		GPIO_DRV_WritePinOutput(RELE3, 0);
		GPIO_DRV_WritePinOutput(RELE4, 0);
		// Check the cgi parameters, e.g., GET /leds.cgi?led=1&led=2
		for (i = 0; i < iNumParams; i++)
		{
			//if pcParmeter contains "led", then one of the LED check boxes has been set on
			if (strcmp(pcParam[i], "ios") == 0)
			{
			//see if checkbox for LED 1 has been set
				if(strcmp(pcValue[i], "1") == 0)
				{
				// switch led 1 ON if 1
					GPIO_DRV_WritePinOutput(RELE1, 1);
				}
				//see if checkbox for LED 2 has been set
				if(strcmp(pcValue[i], "2") == 0)
				{
				// switch led 1 ON if 1
					GPIO_DRV_WritePinOutput(RELE2, 1);
				}
				//see if checkbox for LED 2 has been set
				if(strcmp(pcValue[i], "3") == 0)
				{
				// switch led 1 ON if 1
					GPIO_DRV_WritePinOutput(RELE3, 1);
				}
				//see if checkbox for LED 2 has been set
				if(strcmp(pcValue[i], "4") == 0)
				{
				// switch led 1 ON if 1
					GPIO_DRV_WritePinOutput(RELE4, 1);
				}
				//see if checkbox for LED 2 has been set
			} //if
		} //for
	} //if
	//uniform resource identifier to send after CGI call, i.e., path and filename of the response
	return "/index.htm";
} //LedCGIhandler

// prototype CGI handler for the LED control
const char * IoCGIhandler(int iIndex, int iNumParams, char *pcParam[], char *pcValue[]);
// this structure contains the name of the LED CGI and corresponding handler for the LEDs
const tCGI IoCGI={"/io.cgi", IoCGIhandler};
//table of the CGI names and handlers
tCGI theCGItable[1];

// Initialize the CGI handlers
void myCGIinit(void)
{
	//add LED control CGI to the table
	theCGItable[0] = IoCGI;
	//give the table to the HTTP server
	http_set_cgi_handlers(theCGItable, 1);
} //myCGIinit

//array of tags for the SSI handler
//these are the tags <!--#tag1--> contained in the shtml file
#define numSSItags 2
int incremento = 24;
char myStr3[] = "As informacoes ";
char myStr4[] = "apresentadas aqui ";
char myStr5[] = "variam como ";
char myStr6[] = "modo de testar ";
char myStr7[] = "a atualizacao ";
char myStr8[] = "dos campos ";
char myStr9[] = "das tags ";
char myStr[] = {"   "};
char const *theSSItags[numSSItags] = {"tag1","tag2"};

/**** SSI handler ****/
// This function is called each time the HTTPD server detects a tag of the form
// <!--#name--> in a .shtml, .ssi or .shtm file
// It won't work if the file has a .html extension.
u16_t mySSIHandler(int iIndex, char *pcInsert, int iInsertLen)
{
if (incremento < 126) incremento++; else incremento = 25;
if (incremento != 32) {
	sprintf(myStr, "%d", incremento);
}
	else {
		myStr[0] = 32;
		myStr[1] = 32;
		myStr[2] = 32;
	}
// see which tag in the array theSSItags to handle
if (iIndex == 0) //is “tag1”
{
char myStr1[] = "Caractere enviado pela placa:                            "; //string to be displayed on web page

switch(incremento){
	case 25:{
		strcpy(myStr1, myStr3);
		break;
	}
	case 27:{
		strcpy(myStr1, myStr5);
		break;
	}
	case 29:{
		strcpy(myStr1, myStr7);
		break;
	}
	case 31:{
		strcpy(myStr1, myStr9);
		break;
	}
	default:{
		myStr1[30] = incremento;
		myStr1[31] = 32;
		myStr1[32] = 65;
		myStr1[33] = 83;
		myStr1[34] = 67;
		myStr1[35] = 73;
		myStr1[36] = 73;
		myStr1[37] = 32;
		myStr1[38] = myStr[0];
		myStr1[39] = myStr[1];
		myStr1[40] = myStr[2];
		break;
	}
}
//copy the string to be displayed to pcInsert
strcpy(pcInsert, myStr1);
//return number of characters that need to be inserted in html
return strlen(myStr1);
}
else if (iIndex == 1) //is “tag2”
{
char myStr2[] = "Outro caractere enviado pela placa:                            "; //string to be displayed on web page

switch(incremento){
	case 26:{
		strcpy(myStr2, myStr4);
		break;
	}
	case 28:{
		strcpy(myStr2, myStr6);
		break;
	}
	case 30:{
		strcpy(myStr2, myStr8);
		break;
	}
	case 32:{
		strcpy(myStr2, myStr);
		break;
	}
	default:{
		myStr2[36] = incremento;
		myStr2[37] = 32;
		myStr2[38] = 65;
		myStr2[39] = 83;
		myStr2[40] = 67;
		myStr2[41] = 73;
		myStr2[42] = 73;
		myStr2[43] = 32;
		myStr2[44] = myStr[0];
		myStr2[45] = myStr[1];
		myStr2[46] = myStr[2];
		break;
	}
}

//copy string to be displayed
strcpy(pcInsert, myStr2);
//return number of characters that need to be inserted in html
return strlen(myStr2);
}
return 0;
} //mySSIHandler

/**** Initialize SSI handlers ****/
void mySSIinit(void)
{
//configure SSI handler function
//theSSItags is an array of SSI tag strings to search for in SSI-enabled files
http_set_ssi_handler(mySSIHandler, (char const **)theSSItags, numSSItags);
} //mySSIinit

