2ARC/lwip-on-Kinetis-mcu/Sources/main.c
/*lint -save  -e970 Disable MISRA rule (6.3) checking. */
int main(void)
/*lint -restore Enable MISRA rule (6.3) checking. */
{
  /* Write your local variable definition here */
  /*** Processor Expert internal initialization. DON'T REMOVE THIS CODE!!! ***/
  PE_low_level_init();
  /*** End of Processor Expert internal initialization.                    ***/

  /* Write your code here */
  /* For example: for(;;) { } */
  struct netif fsl_netif0;
  ip_addr_t fsl_netif0_ipaddr, fsl_netif0_netmask, fsl_netif0_gw;
  app_low_level_init();
  OSA_Init();
  lwip_init();
  IP4_ADDR(&fsl_netif0_ipaddr, 192,168,0,100);
  IP4_ADDR(&fsl_netif0_netmask, 255,255,255,0);
  IP4_ADDR(&fsl_netif0_gw, 192,168,0,1);
  netif_add(&fsl_netif0, &fsl_netif0_ipaddr, &fsl_netif0_netmask, &fsl_netif0_gw, NULL, ethernetif_init, ethernet_input);
  netif_set_default(&fsl_netif0);
  netif_set_up(&fsl_netif0);
  httpd_init();
  myCGIinit();
  mySSIinit();
#if !ENET_RECEIVE_ALL_INTERRUPT
  uint32_t devNumber = 0;
  enet_dev_if_t * enetIfPtr;
#if LWIP_HAVE_LOOPIF
  devNumber = fsl_netif0.num - 1;
#else
  devNumber = fsl_netif0.num;
#endif
  enetIfPtr = (enet_dev_if_t *)&enetDevIf[devNumber];
#endif
  while(1)
  {
#if !ENET_RECEIVE_ALL_INTERRUPT
      ENET_receive(enetIfPtr);
#endif
/////////////////////////////////////////////////////
//////// Escrever código útil a partir daqui ////////
/////////////////////////////////////////////////////
}

  /*** Don't write any code pass this line, or it will be deleted during code generation. ***/
  /*** RTOS startup code. Macro PEX_RTOS_START is defined by the RTOS component. DON'T MODIFY THIS CODE!!! ***/
  #ifdef PEX_RTOS_START
    PEX_RTOS_START();                  /* Startup of the selected RTOS. Macro is defined by the RTOS component. */
  #endif
  /*** End of RTOS startup code.  ***/
  /*** Processor Expert end of main routine. DON'T MODIFY THIS CODE!!! ***/
  for(;;){}
  /*** Processor Expert end of main routine. DON'T WRITE CODE BELOW!!! ***/
} /*** End of main routine. DO NOT MODIFY THIS TEXT!!! ***/

/* END main */
/*!
** @}
*/
/*
** ###################################################################
**
**     This file was created by Processor Expert 10.5 [05.21]
**     for the Freescale Kinetis series of microcontrollers.
**
** ###################################################################
*/
